/*
import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:get/get.dart';
import 'package:share_plus/share_plus.dart';
import 'package:wish_message_app/features/common/read_sms.dart';

class EngagementSms extends StatelessWidget {
  const EngagementSms({super.key});

  @override
  Widget build(BuildContext context) {
    return Padding(
      padding: const EdgeInsets.all(16),
      child: Column(
        children: [
          ReadSms(
            message: 'পৃথিবীর সবচেয়ে সুন্দর দম্পতির বাগদানের শুভেচ্ছা! তোমরা একে অপরের ভালোবাসায় আবদ্ধ থাকো!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('পৃথিবীর সবচেয়ে সুন্দর দম্পতির বাগদানের শুভেচ্ছা! তোমরা একে অপরের ভালোবাসায় আবদ্ধ থাকো!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'পৃথিবীর সবচেয়ে সুন্দর দম্পতির বাগদানের শুভেচ্ছা! তোমরা একে অপরের ভালোবাসায় আবদ্ধ থাকো!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'অভিনন্দন! জীবনের এই নতুন অধ্যায় তোমার জন্য সব আনন্দ বয়ে আনুক। আমার ভালোবাসা এবং আশীর্বাদ সবসময় তোমার সাথে থাকবে।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('অভিনন্দন! জীবনের এই নতুন অধ্যায় তোমার জন্য সব আনন্দ বয়ে আনুক। আমার ভালোবাসা এবং আশীর্বাদ সবসময় তোমার সাথে থাকবে।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'অভিনন্দন! জীবনের এই নতুন অধ্যায় তোমার জন্য সব আনন্দ বয়ে আনুক। আমার ভালোবাসা এবং আশীর্বাদ সবসময় তোমার সাথে থাকবে।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের দুজনেরই বাগদানের শুভেচ্ছা! ভালোবাসা, যত্ন এবং সুখে ভরা একটি সুন্দর যাত্রা কামনা করছি।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের দুজনেরই বাগদানের শুভেচ্ছা! ভালোবাসা, যত্ন এবং সুখে ভরা একটি সুন্দর যাত্রা কামনা করছি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের দুজনেরই বাগদানের শুভেচ্ছা! ভালোবাসা, যত্ন এবং সুখে ভরা একটি সুন্দর যাত্রা কামনা করছি।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের দুজনেরই জীবনের সুখ এবং আনন্দময় মুহূর্ত কামনা করছি। সুখী এবং ধন্য থাকো!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের দুজনেরই জীবনের সুখ এবং আনন্দময় মুহূর্ত কামনা করছি। সুখী এবং ধন্য থাকো!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের দুজনেরই জীবনের সুখ এবং আনন্দময় মুহূর্ত কামনা করছি। সুখী এবং ধন্য থাকো!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আমি আশা করি তোমরা সবসময় একে অপরের মধ্যে শান্তি খুঁজে পাবে। আমার প্রার্থনা এবং আশীর্বাদ তোমাদের সাথে আছে।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আমি আশা করি তোমরা সবসময় একে অপরের মধ্যে শান্তি খুঁজে পাবে। আমার প্রার্থনা এবং আশীর্বাদ তোমাদের সাথে আছে।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমি আশা করি তোমরা সবসময় একে অপরের মধ্যে শান্তি খুঁজে পাবে। আমার প্রার্থনা এবং আশীর্বাদ তোমাদের সাথে আছে।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'দুটি হৃদয় একে অপরকে খুঁজে পেয়েছে, আর এর চেয়ে বিশেষ আর কী হতে পারে! তোমার যাত্রার জন্য শুভকামনা!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('দুটি হৃদয় একে অপরকে খুঁজে পেয়েছে, আর এর চেয়ে বিশেষ আর কী হতে পারে! তোমার যাত্রার জন্য শুভকামনা!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'দুটি হৃদয় একে অপরকে খুঁজে পেয়েছে, আর এর চেয়ে বিশেষ আর কী হতে পারে! তোমার যাত্রার জন্য শুভকামনা!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার আংটি অনুষ্ঠানের জন্য অভিনন্দন! তোমার সারাজীবনের সাহচর্য এবং মহান বোঝাপড়া কামনা করছি।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার আংটি অনুষ্ঠানের জন্য অভিনন্দন! তোমার সারাজীবনের সাহচর্য এবং মহান বোঝাপড়া কামনা করছি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার আংটি অনুষ্ঠানের জন্য অভিনন্দন! তোমার সারাজীবনের সাহচর্য এবং মহান বোঝাপড়া কামনা করছি।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message:
            'তোমার বাগদানের জন্য আমি খুব খুশি! তোমার হৃদয় যেন কাছাকাছি থাকে এবং তোমার যাত্রা সুখে পূর্ণ হোক।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার বাগদানের জন্য আমি খুব খুশি! তোমার হৃদয় যেন কাছাকাছি থাকে এবং তোমার যাত্রা সুখে পূর্ণ হোক।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার বাগদানের জন্য আমি খুব খুশি! তোমার হৃদয় যেন কাছাকাছি থাকে এবং তোমার যাত্রা সুখে পূর্ণ হোক।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমরা সত্যিই স্বর্গে তৈরি এক দম্পতি। ঈশ্বর তোমাদের সুন্দর বিবাহের অনেক প্রিয় মুহূর্ত দান করুন।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমরা সত্যিই স্বর্গে তৈরি এক দম্পতি। ঈশ্বর তোমাদের সুন্দর বিবাহের অনেক প্রিয় মুহূর্ত দান করুন।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'বতোমরা সত্যিই স্বর্গে তৈরি এক দম্পতি। ঈশ্বর তোমাদের সুন্দর বিবাহের অনেক প্রিয় মুহূর্ত দান করুন।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'জীবনের সকল সুন্দর জিনিসের জন্য তুমি যোগ্য। তোমরা দুজনেই একসাথে তোমাদের স্বপ্নগুলো খুঁজে পাও এবং তোমাদের ইচ্ছাগুলো পূরণ করো! শুভ বাগদান দিবস!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('জীবনের সকল সুন্দর জিনিসের জন্য তুমি যোগ্য। তোমরা দুজনেই একসাথে তোমাদের স্বপ্নগুলো খুঁজে পাও এবং তোমাদের ইচ্ছাগুলো পূরণ করো! শুভ বাগদান দিবস!');
            },
              copyButton: () {
                Clipboard.setData(
                    ClipboardData(
                      text: 'জীবনের সকল সুন্দর জিনিসের জন্য তুমি যোগ্য। তোমরা দুজনেই একসাথে তোমাদের স্বপ্নগুলো খুঁজে পাও এবং তোমাদের ইচ্ছাগুলো পূরণ করো! শুভ বাগদান দিবস!',));
                Get.snackbar("Message", "Copied");
              },
          ),
          ReadSms(
            message: 'তোমাদের বাগদানের জন্য অভিনন্দন। তোমরা দুজনে খুব সুন্দর দম্পতি। শুভেচ্ছা এবং আশীর্বাদ।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের বাগদানের জন্য অভিনন্দন। তোমরা দুজনে খুব সুন্দর দম্পতি। শুভেচ্ছা এবং আশীর্বাদ।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের বাগদানের জন্য অভিনন্দন। তোমরা দুজনে খুব সুন্দর দম্পতি। শুভেচ্ছা এবং আশীর্বাদ।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'অভিনন্দন ! আমি প্রার্থনা করি যেন তোমাদের হৃদয়ের ভালোবাসা এবং তোমাদের মুখের হাসি চিরকাল অক্ষুণ্ণ থাকে।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('অভিনন্দন ! আমি প্রার্থনা করি যেন তোমাদের হৃদয়ের ভালোবাসা এবং তোমাদের মুখের হাসি চিরকাল অক্ষুণ্ণ থাকে।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'অভিনন্দন ! আমি প্রার্থনা করি যেন তোমাদের হৃদয়ের ভালোবাসা এবং তোমাদের মুখের হাসি চিরকাল অক্ষুণ্ণ থাকে।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের জীবন একে অপরের প্রতি ভালোবাসা এবং স্নেহের অসংখ্য উপহারে ধন্য হোক। তোমাদের দুজনেরই জীবন সুখ এবং সাফল্যে পূর্ণ হোক এই কামনা করি!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের জীবন একে অপরের প্রতি ভালোবাসা এবং স্নেহের অসংখ্য উপহারে ধন্য হোক। তোমাদের দুজনেরই জীবন সুখ এবং সাফল্যে পূর্ণ হোক এই কামনা করি!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের জীবন একে অপরের প্রতি ভালোবাসা এবং স্নেহের অসংখ্য উপহারে ধন্য হোক। তোমাদের দুজনেরই জীবন সুখ এবং সাফল্যে পূর্ণ হোক এই কামনা করি!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আমি প্রার্থনা করি তোমাদের আংটির উজ্জ্বলতা তোমাদের দুজনের জীবনে উজ্জ্বল হোক, তোমাদের বৈবাহিক জীবনকে আরও উজ্জ্বল করে তুলুক। তোমাদের দুজনকেই আমার আন্তরিক শুভেচ্ছা!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আমি প্রার্থনা করি তোমাদের আংটির উজ্জ্বলতা তোমাদের দুজনের জীবনে উজ্জ্বল হোক, তোমাদের বৈবাহিক জীবনকে আরও উজ্জ্বল করে তুলুক। তোমাদের দুজনকেই আমার আন্তরিক শুভেচ্ছা!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমি প্রার্থনা করি তোমাদের আংটির উজ্জ্বলতা তোমাদের দুজনের জীবনে উজ্জ্বল হোক, তোমাদের বৈবাহিক জীবনকে আরও উজ্জ্বল করে তুলুক। তোমাদের দুজনকেই আমার আন্তরিক শুভেচ্ছা!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'এই বাগদান আপনার জন্য প্রচুর আনন্দ এবং অসীম ভালোবাসার পথ বয়ে আনুক! আপনার বাগদান এবং আংটি অনুষ্ঠানের জন্য অভিনন্দন!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('এই বাগদান আপনার জন্য প্রচুর আনন্দ এবং অসীম ভালোবাসার পথ বয়ে আনুক! আপনার বাগদান এবং আংটি অনুষ্ঠানের জন্য অভিনন্দন!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'এই বাগদান আপনার জন্য প্রচুর আনন্দ এবং অসীম ভালোবাসার পথ বয়ে আনুক! আপনার বাগদান এবং আংটি অনুষ্ঠানের জন্য অভিনন্দন!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমরা দুজন সত্যিই একে অপরের জন্য তৈরি। আমি খুব খুশি যে তোমরা দুজনে বাগদান করেছো এবং শীঘ্রই বিয়ে করতে যাচ্ছ। তোমাদের দুজনেরই আগামী জীবন সুন্দর হোক এই কামনা করি।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমরা দুজন সত্যিই একে অপরের জন্য তৈরি। আমি খুব খুশি যে তোমরা দুজনে বাগদান করেছো এবং শীঘ্রই বিয়ে করতে যাচ্ছ। তোমাদের দুজনেরই আগামী জীবন সুন্দর হোক এই কামনা করি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমরা দুজন সত্যিই একে অপরের জন্য তৈরি। আমি খুব খুশি যে তোমরা দুজনে বাগদান করেছো এবং শীঘ্রই বিয়ে করতে যাচ্ছ। তোমাদের দুজনেরই আগামী জীবন সুন্দর হোক এই কামনা করি।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার ভালোবাসার মানুষটির সাথে তোমার বাগদান দেখে আমার আনন্দে অশ্রু ঝরে পড়ছে। অভিনন্দন প্রিয়!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার ভালোবাসার মানুষটির সাথে তোমার বাগদান দেখে আমার আনন্দে অশ্রু ঝরে পড়ছে। অভিনন্দন প্রিয়!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার ভালোবাসার মানুষটির সাথে তোমার বাগদান দেখে আমার আনন্দে অশ্রু ঝরে পড়ছে। অভিনন্দন প্রিয়!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তুমি সবসময়ই একজন ভালো ভাই, আর আমি জানি তুমিও একজন ভালো স্বামী হবে। তোমার সুখী দাম্পত্য জীবন কামনা করি।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তুমি সবসময়ই একজন ভালো ভাই, আর আমি জানি তুমিও একজন ভালো স্বামী হবে। তোমার সুখী দাম্পত্য জীবন কামনা করি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তুমি সবসময়ই একজন ভালো ভাই, আর আমি জানি তুমিও একজন ভালো স্বামী হবে। তোমার সুখী দাম্পত্য জীবন কামনা করি।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'প্রতিকূলতা এবং সুখের সময় একসাথে থাকার প্রতিশ্রুতি দাও, কারণ আজ তোমাদের দুটি আত্মার একত্রে বন্ধনে আবদ্ধ হওয়ার একটি বিশেষ দিন। তোমাদের দুজনকেই অভিনন্দন!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('প্রতিকূলতা এবং সুখের সময় একসাথে থাকার প্রতিশ্রুতি দাও, কারণ আজ তোমাদের দুটি আত্মার একত্রে বন্ধনে আবদ্ধ হওয়ার একটি বিশেষ দিন। তোমাদের দুজনকেই অভিনন্দন!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'প্রতিকূলতা এবং সুখের সময় একসাথে থাকার প্রতিশ্রুতি দাও, কারণ আজ তোমাদের দুটি আত্মার একত্রে বন্ধনে আবদ্ধ হওয়ার একটি বিশেষ দিন। তোমাদের দুজনকেই অভিনন্দন!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার আংটি অনুষ্ঠানের জন্য অভিনন্দন! তোমাকে বর হিসেবে দেখে আমার খুব ভালো লাগছে। তোমার জন্য শুভকামনা!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার আংটি অনুষ্ঠানের জন্য অভিনন্দন! তোমাকে বর হিসেবে দেখে আমার খুব ভালো লাগছে। তোমার জন্য শুভকামনা!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার আংটি অনুষ্ঠানের জন্য অভিনন্দন! তোমাকে বর হিসেবে দেখে আমার খুব ভালো লাগছে। তোমার জন্য শুভকামনা!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের দুজনের ভালোবাসা এবং ঐক্য কামনা করছি এবং তোমাদের জীবনের আগামী দিনগুলো শান্তিপূর্ণ ও চমৎকার হোক এই কামনা করছি। ঈশ্বর তোমাদের দুজনকেই উষ্ণতা এবং যত্ন সহকারে আশীর্বাদ করুন।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের দুজনের ভালোবাসা এবং ঐক্য কামনা করছি এবং তোমাদের জীবনের আগামী দিনগুলো শান্তিপূর্ণ ও চমৎকার হোক এই কামনা করছি। ঈশ্বর তোমাদের দুজনকেই উষ্ণতা এবং যত্ন সহকারে আশীর্বাদ করুন।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের দুজনের ভালোবাসা এবং ঐক্য কামনা করছি এবং তোমাদের জীবনের আগামী দিনগুলো শান্তিপূর্ণ ও চমৎকার হোক এই কামনা করছি। ঈশ্বর তোমাদের দুজনকেই উষ্ণতা এবং যত্ন সহকারে আশীর্বাদ করুন।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'কি আনন্দের ঘোষণা! তোমাদের দুজনের জীবন একসাথে কাটানোর যাত্রা শুরু হোক, যাতে তোমরা আশীর্বাদপ্রাপ্ত হও।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('কি আনন্দের ঘোষণা! তোমাদের দুজনের জীবন একসাথে কাটানোর যাত্রা শুরু হোক, যাতে তোমরা আশীর্বাদপ্রাপ্ত হও।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'কি আনন্দের ঘোষণা! তোমাদের দুজনের জীবন একসাথে কাটানোর যাত্রা শুরু হোক, যাতে তোমরা আশীর্বাদপ্রাপ্ত হও।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার হৃদয়ে ধারণ করা আনন্দের কামনা করছি এবং এটি যেন দীর্ঘ জীবনের নতুন সূচনা হয়। তোমার বাগদানের জন্য অনেক অনেক শুভকামনা!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার হৃদয়ে ধারণ করা আনন্দের কামনা করছি এবং এটি যেন দীর্ঘ জীবনের নতুন সূচনা হয়। তোমার বাগদানের জন্য অনেক অনেক শুভকামনা!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার হৃদয়ে ধারণ করা আনন্দের কামনা করছি এবং এটি যেন দীর্ঘ জীবনের নতুন সূচনা হয়। তোমার বাগদানের জন্য অনেক অনেক শুভকামনা!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আমি কামনা করি যে এই আনন্দঘন উপলক্ষ তোমাদের দুজনের জীবনেই এক নতুন অর্থ যোগ করবে। তোমাদের দুজনের জীবনে যেন অসীম সুখ এবং রোমান্সের আভাস ভেসে ওঠে!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আমি কামনা করি যে এই আনন্দঘন উপলক্ষ তোমাদের দুজনের জীবনেই এক নতুন অর্থ যোগ করবে। তোমাদের দুজনের জীবনে যেন অসীম সুখ এবং রোমান্সের আভাস ভেসে ওঠে!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমি কামনা করি যে এই আনন্দঘন উপলক্ষ তোমাদের দুজনের জীবনেই এক নতুন অর্থ যোগ করবে। তোমাদের দুজনের জীবনে যেন অসীম সুখ এবং রোমান্সের আভাস ভেসে ওঠে!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার বাগদান এবং জীবনের নতুন যাত্রার জন্য শুভকামনা!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার বাগদান অনুষ্ঠানের জন্য অনেক অনেক শুভেচ্ছা! তোমার ভালোবাসা চিরকাল অটুট থাকুক!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার বাগদান অনুষ্ঠানের জন্য অনেক অনেক শুভেচ্ছা! তোমার ভালোবাসা চিরকাল অটুট থাকুক!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের দুজনকে একসাথে দেখে আমার ভালোবাসায় বিশ্বাস হয়। তোমাদের সুখী দাম্পত্য জীবনের কামনা করছি।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের দুজনকে একসাথে দেখে আমার ভালোবাসায় বিশ্বাস হয়। তোমাদের সুখী দাম্পত্য জীবনের কামনা করছি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের দুজনকে একসাথে দেখে আমার ভালোবাসায় বিশ্বাস হয়। তোমাদের সুখী দাম্পত্য জীবনের কামনা করছি।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার জীবনের এই নতুন পথচলায় তোমাকে শুভকামনা!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার জীবনের এই নতুন পথচলায় তোমাকে শুভকামনা!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার জীবনের এই নতুন পথচলায় তোমাকে শুভকামনা!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার প্রেমের গল্প রূপকথাকে বাস্তব মনে করে। আমি তোমার সুখের জন্য প্রার্থনা করি।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার প্রেমের গল্প রূপকথাকে বাস্তব মনে করে। আমি তোমার সুখের জন্য প্রার্থনা করি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার প্রেমের গল্প রূপকথাকে বাস্তব মনে করে। আমি তোমার সুখের জন্য প্রার্থনা করি।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'শুভ বাগদান! সুখী থাকুন এবং একে অপরকে নিঃশর্তভাবে ভালোবাসুন!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('শুভ বাগদান! সুখী থাকুন এবং একে অপরকে নিঃশর্তভাবে ভালোবাসুন!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'শুভ বাগদান! সুখী থাকুন এবং একে অপরকে নিঃশর্তভাবে ভালোবাসুন!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'জীবনের একটা ভালোবাসা শুরু হয় "হ্যাঁ" দিয়ে। তোমার বাগদানের জন্য অভিনন্দন!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('জীবনের একটা ভালোবাসা শুরু হয় "হ্যাঁ" দিয়ে। তোমার বাগদানের জন্য অভিনন্দন!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'জীবনের একটা ভালোবাসা শুরু হয় "হ্যাঁ" দিয়ে। তোমার বাগদানের জন্য অভিনন্দন!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'দুটি হৃদয়, এখন এক হয়ে গেছে। একে অপরের বাহুতে তোমাদের সারাজীবন সুখের কামনা করছি!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('দুটি হৃদয়, এখন এক হয়ে গেছে। একে অপরের বাহুতে তোমাদের সারাজীবন সুখের কামনা করছি!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'দুটি হৃদয়, এখন এক হয়ে গেছে। একে অপরের বাহুতে তোমাদের সারাজীবন সুখের কামনা করছি!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার বাগদানের জন্য অভিনন্দন! এটি "আমি" এবং "তুমি" কীভাবে "আমরা" হয়ে ওঠে তার একটি গল্প।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার বাগদানের জন্য অভিনন্দন! এটি "আমি" এবং "তুমি" কীভাবে "আমরা" হয়ে ওঠে তার একটি গল্প।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার বাগদানের জন্য অভিনন্দন! এটি "আমি" এবং "তুমি" কীভাবে "আমরা" হয়ে ওঠে তার একটি গল্প।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের দুজনের হাসি চিরকাল তোমাদের জীবনকে আলোকিত করুক এই কামনা করি। অভিনন্দন!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের দুজনের হাসি চিরকাল তোমাদের জীবনকে আলোকিত করুক এই কামনা করি। অভিনন্দন!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের দুজনের হাসি চিরকাল তোমাদের জীবনকে আলোকিত করুক এই কামনা করি। অভিনন্দন!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার আংটি অনুষ্ঠানের জন্য অভিনন্দন! তোমার আগামী জীবন সুন্দর হোক!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার আংটি অনুষ্ঠানের জন্য অভিনন্দন! তোমার আগামী জীবন সুন্দর হোক!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার আংটি অনুষ্ঠানের জন্য অভিনন্দন! তোমার আগামী জীবন সুন্দর হোক!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার বাগদানের জন্য অনেক অনেক শুভেচ্ছা! ভালোবাসা আর হাসিতে ভরা মুহূর্তগুলো তোমার জন্য অপেক্ষা করছে!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার বাগদানের জন্য অনেক অনেক শুভেচ্ছা! ভালোবাসা আর হাসিতে ভরা মুহূর্তগুলো তোমার জন্য অপেক্ষা করছে!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার বাগদানের জন্য অনেক অনেক শুভেচ্ছা! ভালোবাসা আর হাসিতে ভরা মুহূর্তগুলো তোমার জন্য অপেক্ষা করছে!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'এই বাগদানের জন্য তোমাদের শুভকামনা! আশা করি এখন থেকে তোমাদের অসীম ভালোবাসা পাবো!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('এই বাগদানের জন্য তোমাদের শুভকামনা! আশা করি এখন থেকে তোমাদের অসীম ভালোবাসা পাবো!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'এই বাগদানের জন্য তোমাদের শুভকামনা! আশা করি এখন থেকে তোমাদের অসীম ভালোবাসা পাবো!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের দুজনের আত্মার সঙ্গী দেখতে ঠিক তেমনই। তোমাদের সারাজীবনের জন্য ভালোবাসা এবং সুখ কামনা করি।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের দুজনের আত্মার সঙ্গী দেখতে ঠিক তেমনই। তোমাদের সারাজীবনের জন্য ভালোবাসা এবং সুখ কামনা করি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের দুজনের আত্মার সঙ্গী দেখতে ঠিক তেমনই। তোমাদের সারাজীবনের জন্য ভালোবাসা এবং সুখ কামনা করি।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'এত সুন্দর একটা জুটির বাগদান দেখে খুব খুশি হলাম। তোমাদের দুজনকেই অভিনন্দন!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('এত সুন্দর একটা জুটির বাগদান দেখে খুব খুশি হলাম। তোমাদের দুজনকেই অভিনন্দন!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'এত সুন্দর একটা জুটির বাগদান দেখে খুব খুশি হলাম। তোমাদের দুজনকেই অভিনন্দন!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার বাগদানের জন্য অভিনন্দন! এই দীর্ঘ এবং চমৎকার যাত্রার শুরু হোক এই কামনা করছি।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার বাগদানের জন্য অভিনন্দন! এই দীর্ঘ এবং চমৎকার যাত্রার শুরু হোক এই কামনা করছি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার বাগদানের জন্য অভিনন্দন! এই দীর্ঘ এবং চমৎকার যাত্রার শুরু হোক এই কামনা করছি।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার বিবাহের বাগদানের জন্য অভিনন্দন। তোমার একসাথে যোগদান তোমার কল্পনার চেয়েও বেশি আনন্দ বয়ে আনুক। শুভকামনা!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার বিবাহের বাগদানের জন্য অভিনন্দন। তোমার একসাথে যোগদান তোমার কল্পনার চেয়েও বেশি আনন্দ বয়ে আনুক। শুভকামনা!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার বিবাহের বাগদানের জন্য অভিনন্দন। তোমার একসাথে যোগদান তোমার কল্পনার চেয়েও বেশি আনন্দ বয়ে আনুক। শুভকামনা!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'গাঁটছড়া বাঁধার জন্য অনেক অনেক অভিনন্দন! আজকের দিনটি হোক একসাথে সুখী জীবনের শুরু। তোমাদের দুজনেরই আগামীর সমৃদ্ধ ভবিষ্যৎ কামনা করছি।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('গাঁটছড়া বাঁধার জন্য অনেক অনেক অভিনন্দন! আজকের দিনটি হোক একসাথে সুখী জীবনের শুরু। তোমাদের দুজনেরই আগামীর সমৃদ্ধ ভবিষ্যৎ কামনা করছি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'গাঁটছড়া বাঁধার জন্য অনেক অনেক অভিনন্দন! আজকের দিনটি হোক একসাথে সুখী জীবনের শুরু। তোমাদের দুজনেরই আগামীর সমৃদ্ধ ভবিষ্যৎ কামনা করছি।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'এই নতুন জীবনের জন্য অভিনন্দন! এই বাগদান হোক সম্মিলিত যাত্রার সূচনা যা অবশেষে তোমাদের বিবাহের মাধ্যমে শেষ হবে!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('এই নতুন জীবনের জন্য অভিনন্দন! এই বাগদান হোক সম্মিলিত যাত্রার সূচনা যা অবশেষে তোমাদের বিবাহের মাধ্যমে শেষ হবে!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'এই নতুন জীবনের জন্য অভিনন্দন! এই বাগদান হোক সম্মিলিত যাত্রার সূচনা যা অবশেষে তোমাদের বিবাহের মাধ্যমে শেষ হবে!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার ভালোবাসার প্রতিধ্বনি সময়ের সাথে সাথে বেজে উঠুক, সুখ, সম্প্রীতি এবং অপরিমেয় ভালোবাসায় অনুরণিত হোক। তোমার আংটি অনুষ্ঠানের জন্য অভিনন্দন!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার ভালোবাসার প্রতিধ্বনি সময়ের সাথে সাথে বেজে উঠুক, সুখ, সম্প্রীতি এবং অপরিমেয় ভালোবাসায় অনুরণিত হোক। তোমার আংটি অনুষ্ঠানের জন্য অভিনন্দন!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার ভালোবাসার প্রতিধ্বনি সময়ের সাথে সাথে বেজে উঠুক, সুখ, সম্প্রীতি এবং অপরিমেয় ভালোবাসায় অনুরণিত হোক। তোমার আংটি অনুষ্ঠানের জন্য অভিনন্দন!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের দুজনের দিকে তাকালেই সহজেই বোঝা যায় যে তোমাদের দুজনের মধ্যে এমন এক ভালোবাসা আছে যা কখনোই ব্যর্থ বা ম্লান হওয়ার নয়। একে অপরের সাথে বাগদানের সিদ্ধান্ত নেওয়াটা দারুন! অভিনন্দন!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের দুজনের দিকে তাকালেই সহজেই বোঝা যায় যে তোমাদের দুজনের মধ্যে এমন এক ভালোবাসা আছে যা কখনোই ব্যর্থ বা ম্লান হওয়ার নয়। একে অপরের সাথে বাগদানের সিদ্ধান্ত নেওয়াটা দারুন! অভিনন্দন!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের দুজনের দিকে তাকালেই সহজেই বোঝা যায় যে তোমাদের দুজনের মধ্যে এমন এক ভালোবাসা আছে যা কখনোই ব্যর্থ বা ম্লান হওয়ার নয়। একে অপরের সাথে বাগদানের সিদ্ধান্ত নেওয়াটা দারুন! অভিনন্দন!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'সুন্দর দম্পতিকে অভিনন্দন। কি দারুন খবর! ঈশ্বর তোমাদের দুজনেরই বাগদানের আশীর্বাদ করুন।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('সুন্দর দম্পতিকে অভিনন্দন। কি দারুন খবর! ঈশ্বর তোমাদের দুজনেরই বাগদানের আশীর্বাদ করুন।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'সুন্দর দম্পতিকে অভিনন্দন। কি দারুন খবর! ঈশ্বর তোমাদের দুজনেরই বাগদানের আশীর্বাদ করুন।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আংটি অনুষ্ঠানের জন্য অভিনন্দন এবং শুভকামনা! এটি আপনার জন্য একটি দুর্দান্ত দিন! এটি আরও আশ্চর্যজনক সময় এবং মুহূর্তগুলির দিন নিয়ে আসুক!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আংটি অনুষ্ঠানের জন্য অভিনন্দন এবং শুভকামনা! এটি আপনার জন্য একটি দুর্দান্ত দিন! এটি আরও আশ্চর্যজনক সময় এবং মুহূর্তগুলির দিন নিয়ে আসুক!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আংটি অনুষ্ঠানের জন্য অভিনন্দন এবং শুভকামনা! এটি আপনার জন্য একটি দুর্দান্ত দিন! এটি আরও আশ্চর্যজনক সময় এবং মুহূর্তগুলির দিন নিয়ে আসুক!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'এই চমৎকার দিনে তোমাদের দুজনকেই সুখ ও আনন্দের পৃথিবী কামনা করছি। তোমাদের বাগদানের জন্য অভিনন্দন, আমরা তোমাদের জন্য খুবই আনন্দিত!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('এই চমৎকার দিনে তোমাদের দুজনকেই সুখ ও আনন্দের পৃথিবী কামনা করছি। তোমাদের বাগদানের জন্য অভিনন্দন, আমরা তোমাদের জন্য খুবই আনন্দিত!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'এই চমৎকার দিনে তোমাদের দুজনকেই সুখ ও আনন্দের পৃথিবী কামনা করছি। তোমাদের বাগদানের জন্য অভিনন্দন, আমরা তোমাদের জন্য খুবই আনন্দিত!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'নিখুঁত দম্পতিকে অভিনন্দন! তোমাদের ভালোবাসা নতুন উচ্চতায় পৌঁছেছে। তোমাদের ভবিষ্যৎ উজ্জ্বল এবং সুখী হোক।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('নিখুঁত দম্পতিকে অভিনন্দন! তোমাদের ভালোবাসা নতুন উচ্চতায় পৌঁছেছে। তোমাদের ভবিষ্যৎ উজ্জ্বল এবং সুখী হোক।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'নিখুঁত দম্পতিকে অভিনন্দন! তোমাদের ভালোবাসা নতুন উচ্চতায় পৌঁছেছে। তোমাদের ভবিষ্যৎ উজ্জ্বল এবং সুখী হোক।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'হবু বর-কনেকে অভিনন্দন! তোমাদের ভালোবাসা প্রতিদিন একে অপরের প্রতি বৃদ্ধি পাক!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('হবু বর-কনেকে অভিনন্দন! তোমাদের ভালোবাসা প্রতিদিন একে অপরের প্রতি বৃদ্ধি পাক!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'হবু বর-কনেকে অভিনন্দন! তোমাদের ভালোবাসা প্রতিদিন একে অপরের প্রতি বৃদ্ধি পাক!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার স্বপ্নের সাফল্য, সুখ এবং চিরস্থায়ী ভালোবাসা কামনা করছি। বাগদানের জন্য অভিনন্দন!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার স্বপ্নের সাফল্য, সুখ এবং চিরস্থায়ী ভালোবাসা কামনা করছি। বাগদানের জন্য অভিনন্দন!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার স্বপ্নের সাফল্য, সুখ এবং চিরস্থায়ী ভালোবাসা কামনা করছি। বাগদানের জন্য অভিনন্দন!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমরা দুজনেই খুব ভাগ্যবান যে এই পৃথিবীর লক্ষ লক্ষ মানুষের মধ্যে একে অপরকে খুঁজে পেয়েছো। তোমরা কত নিখুঁত দম্পতি! অভিনন্দন!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমরা দুজনেই খুব ভাগ্যবান যে এই পৃথিবীর লক্ষ লক্ষ মানুষের মধ্যে একে অপরকে খুঁজে পেয়েছো। তোমরা কত নিখুঁত দম্পতি! অভিনন্দন!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমরা দুজনেই খুব ভাগ্যবান যে এই পৃথিবীর লক্ষ লক্ষ মানুষের মধ্যে একে অপরকে খুঁজে পেয়েছো। তোমরা কত নিখুঁত দম্পতি! অভিনন্দন!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আমি খুবই ভাগ্যবান যে তোমাকে আমার বলতে পারছি, এবং আমি প্রতিশ্রুতি দিচ্ছি যে এটি এভাবেই ধরে রাখার জন্য আমি সর্বাত্মক প্রচেষ্টা করব।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আমি খুবই ভাগ্যবান যে তোমাকে আমার বলতে পারছি, এবং আমি প্রতিশ্রুতি দিচ্ছি যে এটি এভাবেই ধরে রাখার জন্য আমি সর্বাত্মক প্রচেষ্টা করব।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমি খুবই ভাগ্যবান যে তোমাকে আমার বলতে পারছি, এবং আমি প্রতিশ্রুতি দিচ্ছি যে এটি এভাবেই ধরে রাখার জন্য আমি সর্বাত্মক প্রচেষ্টা করব।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার মধ্যেই আমি আমার হারিয়ে যাওয়া জিনিসগুলো খুঁজে পেয়েছি, আর আমি তোমার পাশে থাকতে চাই যতক্ষণ না অনন্তকাল শেষ হয়ে যায়।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার মধ্যেই আমি আমার হারিয়ে যাওয়া জিনিসগুলো খুঁজে পেয়েছি, আর আমি তোমার পাশে থাকতে চাই যতক্ষণ না অনন্তকাল শেষ হয়ে যায়।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার মধ্যেই আমি আমার হারিয়ে যাওয়া জিনিসগুলো খুঁজে পেয়েছি, আর আমি তোমার পাশে থাকতে চাই যতক্ষণ না অনন্তকাল শেষ হয়ে যায়।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তুমি সবসময় আমাকে এমন অনুভূতি দাও যেন আমি ভালোবাসা এবং সুখের স্বর্গে বাস করছি। আমাকে এত ভালোবাসার জন্য ধন্যবাদ। শুভ বাগদান দিবস!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তুমি সবসময় আমাকে এমন অনুভূতি দাও যেন আমি ভালোবাসা এবং সুখের স্বর্গে বাস করছি। আমাকে এত ভালোবাসার জন্য ধন্যবাদ। শুভ বাগদান দিবস!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তুমি সবসময় আমাকে এমন অনুভূতি দাও যেন আমি ভালোবাসা এবং সুখের স্বর্গে বাস করছি। আমাকে এত ভালোবাসার জন্য ধন্যবাদ। শুভ বাগদান দিবস!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আমার প্রিয়তম বাগদত্তা, তুমি আমার হৃদয়ের সবচেয়ে বড় সম্পদ। তোমার সাথে চিরকাল কাটাতে পেরে আমি খুব ভাগ্যবান। আমি তোমাকে গভীরভাবে ভালোবাসি।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আমার প্রিয়তম বাগদত্তা, তুমি আমার হৃদয়ের সবচেয়ে বড় সম্পদ। তোমার সাথে চিরকাল কাটাতে পেরে আমি খুব ভাগ্যবান। আমি তোমাকে গভীরভাবে ভালোবাসি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমার প্রিয়তম বাগদত্তা, তুমি আমার হৃদয়ের সবচেয়ে বড় সম্পদ। তোমার সাথে চিরকাল কাটাতে পেরে আমি খুব ভাগ্যবান। আমি তোমাকে গভীরভাবে ভালোবাসি।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আমি সবসময় তোমাকে আমার পাশে পেয়েছি, কষ্টে-দুঃখে। আমার জীবনের ভালোবাসার সাথে শুভ বাগদান।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আমি সবসময় তোমাকে আমার পাশে পেয়েছি, কষ্টে-দুঃখে। আমার জীবনের ভালোবাসার সাথে শুভ বাগদান।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমি সবসময় তোমাকে আমার পাশে পেয়েছি, কষ্টে-দুঃখে। আমার জীবনের ভালোবাসার সাথে শুভ বাগদান।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার সাথে কাটানো দিনের তুলনায় হাজার বছর সুখে ভরা কিছুই নয়। তোমার ভালোবাসা আমার জীবনের সবচেয়ে বড় অলৌকিক ঘটনা। শুভ বাগদান দিবস আমার ভালোবাসা!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার সাথে কাটানো দিনের তুলনায় হাজার বছর সুখে ভরা কিছুই নয়। তোমার ভালোবাসা আমার জীবনের সবচেয়ে বড় অলৌকিক ঘটনা। শুভ বাগদান দিবস আমার ভালোবাসা!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার সাথে কাটানো দিনের তুলনায় হাজার বছর সুখে ভরা কিছুই নয়। তোমার ভালোবাসা আমার জীবনের সবচেয়ে বড় অলৌকিক ঘটনা। শুভ বাগদান দিবস আমার ভালোবাসা!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'শওই আংটি দিয়ে, আমি তোমাকে আমার হৃদয়ের মালিকানা দিলাম। আমার প্রতিটি মুহূর্ত তোমাকে ভালোবাসার জন্য প্রতিশ্রুতিবদ্ধ। শুভ বাগদান, আমার প্রিয়তমা।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('ওই আংটি দিয়ে, আমি তোমাকে আমার হৃদয়ের মালিকানা দিলাম। আমার প্রতিটি মুহূর্ত তোমাকে ভালোবাসার জন্য প্রতিশ্রুতিবদ্ধ। শুভ বাগদান, আমার প্রিয়তমা।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'ওই আংটি দিয়ে, আমি তোমাকে আমার হৃদয়ের মালিকানা দিলাম। আমার প্রতিটি মুহূর্ত তোমাকে ভালোবাসার জন্য প্রতিশ্রুতিবদ্ধ। শুভ বাগদান, আমার প্রিয়তমা।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তুমি একজন দেবদূত যে আমার পৃথিবীকে স্বর্গে পরিণত করেছে। তোমাকে আনুষ্ঠানিকভাবে আমার জীবনসঙ্গী করার জন্য আমি অধীর আগ্রহে অপেক্ষা করতে পারছি না।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তুমি একজন দেবদূত যে আমার পৃথিবীকে স্বর্গে পরিণত করেছে। তোমাকে আনুষ্ঠানিকভাবে আমার জীবনসঙ্গী করার জন্য আমি অধীর আগ্রহে অপেক্ষা করতে পারছি না।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তুমি একজন দেবদূত যে আমার পৃথিবীকে স্বর্গে পরিণত করেছে। তোমাকে আনুষ্ঠানিকভাবে আমার জীবনসঙ্গী করার জন্য আমি অধীর আগ্রহে অপেক্ষা করতে পারছি না।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার সাথে কাটানো প্রতিটি দিনই আমার কাছে জাদুর মতো লাগে। আমি আমার জীবনের এক মুহূর্তের জন্যও এই জাদু মিস করতে চাই না। শুধু তোমাকে চিরতরে আমার করে নেওয়ার জন্য এত প্রতীক্ষা করছি!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার সাথে কাটানো প্রতিটি দিনই আমার কাছে জাদুর মতো লাগে। আমি আমার জীবনের এক মুহূর্তের জন্যও এই জাদু মিস করতে চাই না। শুধু তোমাকে চিরতরে আমার করে নেওয়ার জন্য এত প্রতীক্ষা করছি!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার সাথে কাটানো প্রতিটি দিনই আমার কাছে জাদুর মতো লাগে। আমি আমার জীবনের এক মুহূর্তের জন্যও এই জাদু মিস করতে চাই না। শুধু তোমাকে চিরতরে আমার করে নেওয়ার জন্য এত প্রতীক্ষা করছি!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আমাদের একতার স্বপ্ন সত্যি হতে দেখে আজ থেকে শুরু হওয়া ভালোবাসার সুন্দর যাত্রার কথা ভেবে আমার হৃদয় আপ্লুত হয়ে ওঠে।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আমাদের একতার স্বপ্ন সত্যি হতে দেখে আজ থেকে শুরু হওয়া ভালোবাসার সুন্দর যাত্রার কথা ভেবে আমার হৃদয় আপ্লুত হয়ে ওঠে।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমাদের একতার স্বপ্ন সত্যি হতে দেখে আজ থেকে শুরু হওয়া ভালোবাসার সুন্দর যাত্রার কথা ভেবে আমার হৃদয় আপ্লুত হয়ে ওঠে।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আজ আমাদের আত্মা চিরতরে বন্ধনে আবদ্ধ হচ্ছে; আমি কঠিন সময়ে তোমাকে সমর্থন করার এবং চিরকাল তোমার শক্তি হওয়ার প্রতিশ্রুতি দিচ্ছি। শুভ বাগদান!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আজ আমাদের আত্মা চিরতরে বন্ধনে আবদ্ধ হচ্ছে; আমি কঠিন সময়ে তোমাকে সমর্থন করার এবং চিরকাল তোমার শক্তি হওয়ার প্রতিশ্রুতি দিচ্ছি। শুভ বাগদান!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আজ আমাদের আত্মা চিরতরে বন্ধনে আবদ্ধ হচ্ছে; আমি কঠিন সময়ে তোমাকে সমর্থন করার এবং চিরকাল তোমার শক্তি হওয়ার প্রতিশ্রুতি দিচ্ছি। শুভ বাগদান!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আমরা সবেমাত্র আংটি বিনিময় করেছি এবং এখন মনে হচ্ছে আমাদের আত্মা একে অপরের সাথে সংযুক্ত। শুভ বাগদান, আমার শীঘ্রই হতে যাওয়া জীবনসঙ্গী!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আমরা সবেমাত্র আংটি বিনিময় করেছি এবং এখন মনে হচ্ছে আমাদের আত্মা একে অপরের সাথে সংযুক্ত। শুভ বাগদান, আমার শীঘ্রই হতে যাওয়া জীবনসঙ্গী!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমরা সবেমাত্র আংটি বিনিময় করেছি এবং এখন মনে হচ্ছে আমাদের আত্মা একে অপরের সাথে সংযুক্ত। শুভ বাগদান, আমার শীঘ্রই হতে যাওয়া জীবনসঙ্গী!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'অবশেষে, সেই দিন এসে গেছে যখন তোমার সাথে আমার বাগদান হবে। আমরা কেবল বাগদানই করছি না, আমরা আমাদের আত্মাকে একত্রিত করব যাতে আমাদের ভালোবাসা স্বর্গের সর্বোচ্চ উচ্চতায় পৌঁছায়।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('অবশেষে, সেই দিন এসে গেছে যখন তোমার সাথে আমার বাগদান হবে। আমরা কেবল বাগদানই করছি না, আমরা আমাদের আত্মাকে একত্রিত করব যাতে আমাদের ভালোবাসা স্বর্গের সর্বোচ্চ উচ্চতায় পৌঁছায়।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'অবশেষে, সেই দিন এসে গেছে যখন তোমার সাথে আমার বাগদান হবে। আমরা কেবল বাগদানই করছি না, আমরা আমাদের আত্মাকে একত্রিত করব যাতে আমাদের ভালোবাসা স্বর্গের সর্বোচ্চ উচ্চতায় পৌঁছায়।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তুমি পৃথিবীতে খুঁজে পাওয়া স্বর্গের এক টুকরো এবং তোমার পাশে আমার বাকি জীবন কাটানোর জন্য আমি অধীর আগ্রহে অপেক্ষা করতে পারছি না। শুভ বাগদান, প্রিয়তম।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তুমি পৃথিবীতে খুঁজে পাওয়া স্বর্গের এক টুকরো এবং তোমার পাশে আমার বাকি জীবন কাটানোর জন্য আমি অধীর আগ্রহে অপেক্ষা করতে পারছি না। শুভ বাগদান, প্রিয়তম।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তুমি পৃথিবীতে খুঁজে পাওয়া স্বর্গের এক টুকরো এবং তোমার পাশে আমার বাকি জীবন কাটানোর জন্য আমি অধীর আগ্রহে অপেক্ষা করতে পারছি না। শুভ বাগদান, প্রিয়তম।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'শুভ বাগদান, আমার চিরকালের সঙ্গী। তোমার সাথে থাকাটা আমার কাছে এখনকার স্বপ্নের মতো, আর একসাথে আমাদের ঘর তৈরি করাটাই আমার কাছে এখন স্বপ্নের মতো।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('শুভ বাগদান, আমার চিরকালের সঙ্গী। তোমার সাথে থাকাটা আমার কাছে এখনকার স্বপ্নের মতো, আর একসাথে আমাদের ঘর তৈরি করাটাই আমার কাছে এখন স্বপ্নের মতো।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'শুভ বাগদান, আমার চিরকালের সঙ্গী। তোমার সাথে থাকাটা আমার কাছে এখনকার স্বপ্নের মতো, আর একসাথে আমাদের ঘর তৈরি করাটাই আমার কাছে এখন স্বপ্নের মতো।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার প্রিয়জনের সাথে হাত মিলিয়ে জীবনে আরও এগিয়ে যাওয়ার উৎসাহ খুঁজে পাও। তোমার বাগদানের জন্য অনেক অনেক শুভেচ্ছা!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার প্রিয়জনের সাথে হাত মিলিয়ে জীবনে আরও এগিয়ে যাওয়ার উৎসাহ খুঁজে পাও। তোমার বাগদানের জন্য অনেক অনেক শুভেচ্ছা!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার প্রিয়জনের সাথে হাত মিলিয়ে জীবনে আরও এগিয়ে যাওয়ার উৎসাহ খুঁজে পাও। তোমার বাগদানের জন্য অনেক অনেক শুভেচ্ছা!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমরা একে অপরকে কতটা খুশি করো তা দেখে, তোমাদের ভবিষ্যতের জন্য আমি উত্তেজিত না হয়ে পারছি না। অভিনন্দন!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমরা একে অপরকে কতটা খুশি করো তা দেখে, তোমাদের ভবিষ্যতের জন্য আমি উত্তেজিত না হয়ে পারছি না। অভিনন্দন!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমরা একে অপরকে কতটা খুশি করো তা দেখে, তোমাদের ভবিষ্যতের জন্য আমি উত্তেজিত না হয়ে পারছি না। অভিনন্দন!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'বিশ্বাসই হচ্ছে না আমার বোন কনে হতে চলেছে! তোমার বাগদান শুভ হোক এবং সুন্দর বিবাহ হোক। ভালোবাসা এবং আশীর্বাদ পাঠাচ্ছি।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('বিশ্বাসই হচ্ছে না আমার বোন কনে হতে চলেছে! তোমার বাগদান শুভ হোক এবং সুন্দর বিবাহ হোক। ভালোবাসা এবং আশীর্বাদ পাঠাচ্ছি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'বিশ্বাসই হচ্ছে না আমার বোন কনে হতে চলেছে! তোমার বাগদান শুভ হোক এবং সুন্দর বিবাহ হোক। ভালোবাসা এবং আশীর্বাদ পাঠাচ্ছি।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার দিনগুলো যেন এখনকার মতোই আনন্দের হয়। তোমার বাগদানের জন্য অভিনন্দন প্রিয় বোন !',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার দিনগুলো যেন এখনকার মতোই আনন্দের হয়। তোমার বাগদানের জন্য অভিনন্দন প্রিয় বোন !');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার দিনগুলো যেন এখনকার মতোই আনন্দের হয়। তোমার বাগদানের জন্য অভিনন্দন প্রিয় বোন !',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আজ তোমাকে রাজকন্যার মতো দেখাচ্ছে। আমি নিশ্চিত তোমার সঙ্গী তোমাকে তার জীবনসঙ্গী হিসেবে পেয়ে খুব খুশি। অভিনন্দন আমার প্রিয় বোন!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আজ তোমাকে রাজকন্যার মতো দেখাচ্ছে। আমি নিশ্চিত তোমার সঙ্গী তোমাকে তার জীবনসঙ্গী হিসেবে পেয়ে খুব খুশি। অভিনন্দন আমার প্রিয় বোন!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আজ তোমাকে রাজকন্যার মতো দেখাচ্ছে। আমি নিশ্চিত তোমার সঙ্গী তোমাকে তার জীবনসঙ্গী হিসেবে পেয়ে খুব খুশি। অভিনন্দন আমার প্রিয় বোন!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার বাগদান নিয়ে আমার কোনও চিন্তা নেই, কারণ আমি জানি তোমার আত্মার সঙ্গী সবসময় তোমার ছায়ার মতো তোমার সাথে থাকবে, জীবনের সমস্ত প্রতিকূলতা থেকে তোমাকে রক্ষা করবে। অভিনন্দন!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার বাগদান নিয়ে আমার কোনও চিন্তা নেই, কারণ আমি জানি তোমার আত্মার সঙ্গী সবসময় তোমার ছায়ার মতো তোমার সাথে থাকবে, জীবনের সমস্ত প্রতিকূলতা থেকে তোমাকে রক্ষা করবে। অভিনন্দন!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার বাগদান নিয়ে আমার কোনও চিন্তা নেই, কারণ আমি জানি তোমার আত্মার সঙ্গী সবসময় তোমার ছায়ার মতো তোমার সাথে থাকবে, জীবনের সমস্ত প্রতিকূলতা থেকে তোমাকে রক্ষা করবে। অভিনন্দন!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের দুজনের আংটি বিনিময়ের মুহূর্তেই তোমাদের বৈবাহিক জীবন আনন্দে ভরে উঠুক এবং বিশ্বাসে ভরে উঠুক। তোমাদের আগামী বিবাহিত জীবন সুন্দর হোক!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের দুজনের আংটি বিনিময়ের মুহূর্তেই তোমাদের বৈবাহিক জীবন আনন্দে ভরে উঠুক এবং বিশ্বাসে ভরে উঠুক। তোমাদের আগামী বিবাহিত জীবন সুন্দর হোক!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের দুজনের আংটি বিনিময়ের মুহূর্তেই তোমাদের বৈবাহিক জীবন আনন্দে ভরে উঠুক এবং বিশ্বাসে ভরে উঠুক। তোমাদের আগামী বিবাহিত জীবন সুন্দর হোক!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের দুজনকে রাজপুত্র এবং তার রাজকন্যার মতো একে অপরের হাত ধরে করিডোরে একসাথে হাঁটতে দেখাটা সত্যিই দারুন অনুভূতি হবে। অভিনন্দন ভাই!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের দুজনকে রাজপুত্র এবং তার রাজকন্যার মতো একে অপরের হাত ধরে করিডোরে একসাথে হাঁটতে দেখাটা সত্যিই দারুন অনুভূতি হবে। অভিনন্দন ভাই!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের দুজনকে রাজপুত্র এবং তার রাজকন্যার মতো একে অপরের হাত ধরে করিডোরে একসাথে হাঁটতে দেখাটা সত্যিই দারুন অনুভূতি হবে। অভিনন্দন ভাই!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আমি খুব খুশি যে তুমি অবশেষে তোমার জীবনের আত্মার সঙ্গী খুঁজে পেয়েছো। তাকে এবং তার ভালোবাসাকে তোমার হৃদয়ে ধারণ করো এবং কখনোই কোনো কিছুকে একে অপরের থেকে আলাদা হতে দিও না। শুভ বাগদান!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আমি খুব খুশি যে তুমি অবশেষে তোমার জীবনের আত্মার সঙ্গী খুঁজে পেয়েছো। তাকে এবং তার ভালোবাসাকে তোমার হৃদয়ে ধারণ করো এবং কখনোই কোনো কিছুকে একে অপরের থেকে আলাদা হতে দিও না। শুভ বাগদান!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমি খুব খুশি যে তুমি অবশেষে তোমার জীবনের আত্মার সঙ্গী খুঁজে পেয়েছো। তাকে এবং তার ভালোবাসাকে তোমার হৃদয়ে ধারণ করো এবং কখনোই কোনো কিছুকে একে অপরের থেকে আলাদা হতে দিও না। শুভ বাগদান!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার এবং তোমার নতুন জীবনের জন্য শুভকামনা, যা সবেমাত্র শুরু হতে চলেছে। শেষ পর্যন্ত তোমার সুখই আমাদের কাছে সবচেয়ে গুরুত্বপূর্ণ। অভিনন্দন, কন্যা!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার এবং তোমার নতুন জীবনের জন্য শুভকামনা, যা সবেমাত্র শুরু হতে চলেছে। শেষ পর্যন্ত তোমার সুখই আমাদের কাছে সবচেয়ে গুরুত্বপূর্ণ। অভিনন্দন, কন্যা!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার এবং তোমার নতুন জীবনের জন্য শুভকামনা, যা সবেমাত্র শুরু হতে চলেছে। শেষ পর্যন্ত তোমার সুখই আমাদের কাছে সবচেয়ে গুরুত্বপূর্ণ। অভিনন্দন, কন্যা!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আমাদের বাচ্চাদের বিয়ে হতে দেখাটা খুবই আবেগঘন অনুভূতি। আমরা খুব খুশি। তোমাদের দুজনের জন্যই আমরা অনেক অনেক শুভেচ্ছা এবং প্রার্থনা করছি। শুভকামনা।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আমাদের বাচ্চাদের বিয়ে হতে দেখাটা খুবই আবেগঘন অনুভূতি। আমরা খুব খুশি। তোমাদের দুজনের জন্যই আমরা অনেক অনেক শুভেচ্ছা এবং প্রার্থনা করছি। শুভকামনা।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমাদের বাচ্চাদের বিয়ে হতে দেখাটা খুবই আবেগঘন অনুভূতি। আমরা খুব খুশি। তোমাদের দুজনের জন্যই আমরা অনেক অনেক শুভেচ্ছা এবং প্রার্থনা করছি। শুভকামনা।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আগামী বছরগুলিতে ঈশ্বর আপনার উপর তাঁর আশীর্বাদ বর্ষণ করুন। আপনি সর্বদা আমাদের জন্য এক মূল্যবান সম্পদ। আপনার নতুন জীবন সুখে ভরে উঠবে এই বিশ্বাস করার আমাদের যথেষ্ট কারণ আছে!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আগামী বছরগুলিতে ঈশ্বর আপনার উপর তাঁর আশীর্বাদ বর্ষণ করুন। আপনি সর্বদা আমাদের জন্য এক মূল্যবান সম্পদ। আপনার নতুন জীবন সুখে ভরে উঠবে এই বিশ্বাস করার আমাদের যথেষ্ট কারণ আছে!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আগামী বছরগুলিতে ঈশ্বর আপনার উপর তাঁর আশীর্বাদ বর্ষণ করুন। আপনি সর্বদা আমাদের জন্য এক মূল্যবান সম্পদ। আপনার নতুন জীবন সুখে ভরে উঠবে এই বিশ্বাস করার আমাদের যথেষ্ট কারণ আছে!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার নতুন জীবন যৌবনের স্বাদ এবং নতুন ভালোবাসার সুবাসে ভরে উঠুক। অভিনন্দন আমার প্রিয় পুত্র। তুমি আমাদের সত্যিই খুশি করেছ!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার নতুন জীবন যৌবনের স্বাদ এবং নতুন ভালোবাসার সুবাসে ভরে উঠুক। অভিনন্দন আমার প্রিয় পুত্র। তুমি আমাদের সত্যিই খুশি করেছ!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার নতুন জীবন যৌবনের স্বাদ এবং নতুন ভালোবাসার সুবাসে ভরে উঠুক। অভিনন্দন আমার প্রিয় পুত্র। তুমি আমাদের সত্যিই খুশি করেছ!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার সঙ্গী যেভাবে তোমাকে এত পরিপূর্ণ এবং সন্তুষ্ট দেখায়, আমরা সবসময়ই তা উপভোগ করেছি। এই ব্যক্তির চেয়ে তোমার জন্য ভালো আর কেউ হতে পারে না। শুভ বাগদান প্রিয় কন্যা!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার সঙ্গী যেভাবে তোমাকে এত পরিপূর্ণ এবং সন্তুষ্ট দেখায়, আমরা সবসময়ই তা উপভোগ করেছি। এই ব্যক্তির চেয়ে তোমার জন্য ভালো আর কেউ হতে পারে না। শুভ বাগদান প্রিয় কন্যা!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার সঙ্গী যেভাবে তোমাকে এত পরিপূর্ণ এবং সন্তুষ্ট দেখায়, আমরা সবসময়ই তা উপভোগ করেছি। এই ব্যক্তির চেয়ে তোমার জন্য ভালো আর কেউ হতে পারে না। শুভ বাগদান প্রিয় কন্যা!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আমার প্রিয় ছেলে/মেয়ে, তোমার প্রিয়জনের সাথে বাগদান এবং জীবনের সবচেয়ে গুরুত্বপূর্ণ পর্যায়ে পা রাখার জন্য আন্তরিক অভিনন্দন। তোমার জন্য ভালোবাসা এবং আশীর্বাদ।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আমার প্রিয় ছেলে/মেয়ে, তোমার প্রিয়জনের সাথে বাগদান এবং জীবনের সবচেয়ে গুরুত্বপূর্ণ পর্যায়ে পা রাখার জন্য আন্তরিক অভিনন্দন। তোমার জন্য ভালোবাসা এবং আশীর্বাদ।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমার প্রিয় ছেলে/মেয়ে, তোমার প্রিয়জনের সাথে বাগদান এবং জীবনের সবচেয়ে গুরুত্বপূর্ণ পর্যায়ে পা রাখার জন্য আন্তরিক অভিনন্দন। তোমার জন্য ভালোবাসা এবং আশীর্বাদ।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'অভিনন্দন আমার সন্তান। তোমাকে স্থায়ী হতে দেখে আমরা খুশি। তোমরা একে অপরের জন্য তৈরি। আমাদের আশীর্বাদ তোমাদের সাথে আছে। তোমাদের দুজনকে একটি পরিবার হতে দেখে আমরা আনন্দিত!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('অভিনন্দন আমার সন্তান। তোমাকে স্থায়ী হতে দেখে আমরা খুশি। তোমরা একে অপরের জন্য তৈরি। আমাদের আশীর্বাদ তোমাদের সাথে আছে। তোমাদের দুজনকে একটি পরিবার হতে দেখে আমরা আনন্দিত!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'অভিনন্দন আমার সন্তান। তোমাকে স্থায়ী হতে দেখে আমরা খুশি। তোমরা একে অপরের জন্য তৈরি। আমাদের আশীর্বাদ তোমাদের সাথে আছে। তোমাদের দুজনকে একটি পরিবার হতে দেখে আমরা আনন্দিত!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'ঈশ্বর আমাদের সন্তানকে তাঁর ঐশ্বরিক ভালোবাসা এবং আশীর্বাদে বর্ষণ করুন। আপনি যেখানেই যান না কেন, আপনার প্রতিটি পদক্ষেপে সৌভাগ্য আসুক। একসাথে নতুন জীবন গড়ার জন্য আপনার মঙ্গল কামনা করছি।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('ঈশ্বর আমাদের সন্তানকে তাঁর ঐশ্বরিক ভালোবাসা এবং আশীর্বাদে বর্ষণ করুন। আপনি যেখানেই যান না কেন, আপনার প্রতিটি পদক্ষেপে সৌভাগ্য আসুক। একসাথে নতুন জীবন গড়ার জন্য আপনার মঙ্গল কামনা করছি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'ঈশ্বর আমাদের সন্তানকে তাঁর ঐশ্বরিক ভালোবাসা এবং আশীর্বাদে বর্ষণ করুন। আপনি যেখানেই যান না কেন, আপনার প্রতিটি পদক্ষেপে সৌভাগ্য আসুক। একসাথে নতুন জীবন গড়ার জন্য আপনার মঙ্গল কামনা করছি।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার বাগদানের জন্য আমরা তোমাকে আন্তরিক অভিনন্দন জানাই। তুমি তোমার আত্মার সঙ্গী খুঁজে পেয়েছো জেনে আমরা গর্বিত। তোমার সুখী বিবাহিত জীবন কামনা করি।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার বাগদানের জন্য আমরা তোমাকে আন্তরিক অভিনন্দন জানাই। তুমি তোমার আত্মার সঙ্গী খুঁজে পেয়েছো জেনে আমরা গর্বিত। তোমার সুখী বিবাহিত জীবন কামনা করি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার বাগদানের জন্য আমরা তোমাকে আন্তরিক অভিনন্দন জানাই। তুমি তোমার আত্মার সঙ্গী খুঁজে পেয়েছো জেনে আমরা গর্বিত। তোমার সুখী বিবাহিত জীবন কামনা করি।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'অভিনন্দন, বন্ধু! এই বাগদান তোমার জীবনের সবচেয়ে আনন্দের মুহূর্তগুলির মধ্যে একটি হোক!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('অভিনন্দন, বন্ধু! এই বাগদান তোমার জীবনের সবচেয়ে আনন্দের মুহূর্তগুলির মধ্যে একটি হোক!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'অভিনন্দন, বন্ধু! এই বাগদান তোমার জীবনের সবচেয়ে আনন্দের মুহূর্তগুলির মধ্যে একটি হোক!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'একে অপরের হাত শক্ত করে ধরো এবং তোমাদের প্রতিটি লক্ষ্য পূরণ করো। জীবনের এই নতুন অধ্যায়ে, তোমাদের শুভকামনা জানাই।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('একে অপরের হাত শক্ত করে ধরো এবং তোমাদের প্রতিটি লক্ষ্য পূরণ করো। জীবনের এই নতুন অধ্যায়ে, তোমাদের শুভকামনা জানাই।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'একে অপরের হাত শক্ত করে ধরো এবং তোমাদের প্রতিটি লক্ষ্য পূরণ করো। জীবনের এই নতুন অধ্যায়ে, তোমাদের শুভকামনা জানাই।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আমি এখনও বিশ্বাস করতে পারছি না যে সেই বোকা কিশোরটিকে আমি আগে জানতাম, সে এখন প্রাপ্তবয়স্ক এবং বাগদানের দ্বারপ্রান্তে পৌঁছে গেছে! অভিনন্দন, বন্ধু।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আমি এখনও বিশ্বাস করতে পারছি না যে সেই বোকা কিশোরটিকে আমি আগে জানতাম, সে এখন প্রাপ্তবয়স্ক এবং বাগদানের দ্বারপ্রান্তে পৌঁছে গেছে! অভিনন্দন, বন্ধু।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমি এখনও বিশ্বাস করতে পারছি না যে সেই বোকা কিশোরটিকে আমি আগে জানতাম, সে এখন প্রাপ্তবয়স্ক এবং বাগদানের দ্বারপ্রান্তে পৌঁছে গেছে! অভিনন্দন, বন্ধু।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'শুভ বাগদান, বন্ধু! অসীম সুখ, ভালোবাসা এবং ঐক্যে ভরে উঠুক তোমার জীবন!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('শুভ বাগদান, বন্ধু! অসীম সুখ, ভালোবাসা এবং ঐক্যে ভরে উঠুক তোমার জীবন!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'শুভ বাগদান, বন্ধু! অসীম সুখ, ভালোবাসা এবং ঐক্যে ভরে উঠুক তোমার জীবন!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের একসাথে জীবন গড়ার প্রথম পদক্ষেপ নিতে দেখে আমি আনন্দিত। অভিনন্দন প্রিয় বন্ধু!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের একসাথে জীবন গড়ার প্রথম পদক্ষেপ নিতে দেখে আমি আনন্দিত। অভিনন্দন প্রিয় বন্ধু!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের একসাথে জীবন গড়ার প্রথম পদক্ষেপ নিতে দেখে আমি আনন্দিত। অভিনন্দন প্রিয় বন্ধু!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের দুজনের হাত ধরে থাকা দেখার চেয়ে বেশি খুশি আর কিছু হতে পারে না। আমার চোখ ধন্য এবং আমি প্রার্থনা করি যেন সমস্ত সুখ তোমাদের দরজায় কড়া নাড়ে। অভিনন্দন।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের দুজনের হাত ধরে থাকা দেখার চেয়ে বেশি খুশি আর কিছু হতে পারে না। আমার চোখ ধন্য এবং আমি প্রার্থনা করি যেন সমস্ত সুখ তোমাদের দরজায় কড়া নাড়ে। অভিনন্দন।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের দুজনের হাত ধরে থাকা দেখার চেয়ে বেশি খুশি আর কিছু হতে পারে না। আমার চোখ ধন্য এবং আমি প্রার্থনা করি যেন সমস্ত সুখ তোমাদের দরজায় কড়া নাড়ে। অভিনন্দন।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার বাগদানের দিনটি সর্বশক্তিমানের আশীর্বাদ এবং তোমার প্রিয়জনদের প্রার্থনায় আশীর্বাদপূর্ণ হোক।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার বাগদানের দিনটি সর্বশক্তিমানের আশীর্বাদ এবং তোমার প্রিয়জনদের প্রার্থনায় আশীর্বাদপূর্ণ হোক।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার বাগদানের দিনটি সর্বশক্তিমানের আশীর্বাদ এবং তোমার প্রিয়জনদের প্রার্থনায় আশীর্বাদপূর্ণ হোক।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তুমি যেন স্বর্গের সকল ফেরেশতাদের সকল আশীর্বাদ পাও যাতে তুমি আনন্দের সাথে সাহচর্যের যাত্রা শুরু করতে পারো।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তুমি যেন স্বর্গের সকল ফেরেশতাদের সকল আশীর্বাদ পাও যাতে তুমি আনন্দের সাথে সাহচর্যের যাত্রা শুরু করতে পারো।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তুমি যেন স্বর্গের সকল ফেরেশতাদের সকল আশীর্বাদ পাও যাতে তুমি আনন্দের সাথে সাহচর্যের যাত্রা শুরু করতে পারো।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আজ তোমার স্বামী তোমাকে যে ভালোবাসার প্রতীক দেবেন, তার উপর সর্বশক্তিমান তাঁর আশীর্বাদ বর্ষণ করুন। পূর্ণ আনন্দের সাথে তোমার ভালোবাসার যাত্রা শুরু করো!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আজ তোমার স্বামী তোমাকে যে ভালোবাসার প্রতীক দেবেন, তার উপর সর্বশক্তিমান তাঁর আশীর্বাদ বর্ষণ করুন। পূর্ণ আনন্দের সাথে তোমার ভালোবাসার যাত্রা শুরু করো!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আজ তোমার স্বামী তোমাকে যে ভালোবাসার প্রতীক দেবেন, তার উপর সর্বশক্তিমান তাঁর আশীর্বাদ বর্ষণ করুন। পূর্ণ আনন্দের সাথে তোমার ভালোবাসার যাত্রা শুরু করো!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'ঈশ্বর তোমাদের দুজনকেই পথ দেখান এবং তোমাদের সম্পর্ককে ধৈর্য, ভালোবাসা এবং যত্নের সাথে আশীর্বাদ করুন।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('ঈশ্বর তোমাদের দুজনকেই পথ দেখান এবং তোমাদের সম্পর্ককে ধৈর্য, ভালোবাসা এবং যত্নের সাথে আশীর্বাদ করুন।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'ঈশ্বর তোমাদের দুজনকেই পথ দেখান এবং তোমাদের সম্পর্ককে ধৈর্য, ভালোবাসা এবং যত্নের সাথে আশীর্বাদ করুন।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের হৃদয় কাছে থাকুক, তোমাদের মন খোলা থাকুক, আর তোমাদের ভালোবাসা চিরকাল শক্তিশালী থাকুক।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের হৃদয় কাছে থাকুক, তোমাদের মন খোলা থাকুক, আর তোমাদের ভালোবাসা চিরকাল শক্তিশালী থাকুক।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের হৃদয় কাছে থাকুক, তোমাদের মন খোলা থাকুক, আর তোমাদের ভালোবাসা চিরকাল শক্তিশালী থাকুক।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আমি প্রার্থনা করি প্রভু যেন আপনার হৃদয় শান্তিতে পূর্ণ করেন এবং আপনাকে একটি শক্তিশালী ও বিশ্বস্ত বন্ধন গড়ে তুলতে সাহায্য করেন।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আমি প্রার্থনা করি প্রভু যেন আপনার হৃদয় শান্তিতে পূর্ণ করেন এবং আপনাকে একটি শক্তিশালী ও বিশ্বস্ত বন্ধন গড়ে তুলতে সাহায্য করেন।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমি প্রার্থনা করি প্রভু যেন আপনার হৃদয় শান্তিতে পূর্ণ করেন এবং আপনাকে একটি শক্তিশালী ও বিশ্বস্ত বন্ধন গড়ে তুলতে সাহায্য করেন।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আল্লাহ তোমাদের বাগদানে বরকত দান করুন এবং তোমাদের ভবিষ্যতে বরকত দান করুন।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আল্লাহ তোমাদের বাগদানে বরকত দান করুন এবং তোমাদের ভবিষ্যতে বরকত দান করুন।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আল্লাহ তোমাদের বাগদানে বরকত দান করুন এবং তোমাদের ভবিষ্যতে বরকত দান করুন।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আমাদের সকলের আশীর্বাদে, তোমাদের ভালোবাসার জীবনের যাত্রা একে অপরের প্রতি সমর্থন এবং বিশ্বাসে পূর্ণ হোক। তোমাদের বাগদানের দিনটি আনন্দময় হোক!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আমাদের সকলের আশীর্বাদে, তোমাদের ভালোবাসার জীবনের যাত্রা একে অপরের প্রতি সমর্থন এবং বিশ্বাসে পূর্ণ হোক। তোমাদের বাগদানের দিনটি আনন্দময় হোক!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমাদের সকলের আশীর্বাদে, তোমাদের ভালোবাসার জীবনের যাত্রা একে অপরের প্রতি সমর্থন এবং বিশ্বাসে পূর্ণ হোক। তোমাদের বাগদানের দিনটি আনন্দময় হোক!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আমি প্রার্থনা করি যে প্রভু তোমাদের দুজনের পাশে থাকুন, তোমাদের ভালোবাসাকে শক্তিশালী রাখুন এবং তোমাদের হৃদয়কে বিনয়ী রাখুন যখন তোমরা একসাথে এই নতুন অধ্যায় শুরু করবে।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আমি প্রার্থনা করি যে প্রভু তোমাদের দুজনের পাশে থাকুন, তোমাদের ভালোবাসাকে শক্তিশালী রাখুন এবং তোমাদের হৃদয়কে বিনয়ী রাখুন যখন তোমরা একসাথে এই নতুন অধ্যায় শুরু করবে।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমি প্রার্থনা করি যে প্রভু তোমাদের দুজনের পাশে থাকুন, তোমাদের ভালোবাসাকে শক্তিশালী রাখুন এবং তোমাদের হৃদয়কে বিনয়ী রাখুন যখন তোমরা একসাথে এই নতুন অধ্যায় শুরু করবে।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'ফেরেশতারা যেন তোমার ভালোবাসা রক্ষা করে এবং তোমার ভবিষ্যৎকে পথ দেখায়। আমি প্রার্থনা করি এই ব্যস্ততা তোমার আত্মার মধ্যে আশীর্বাদ এবং গভীর সংযোগ বয়ে আনুক।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('ফেরেশতারা যেন তোমার ভালোবাসা রক্ষা করে এবং তোমার ভবিষ্যৎকে পথ দেখায়। আমি প্রার্থনা করি এই ব্যস্ততা তোমার আত্মার মধ্যে আশীর্বাদ এবং গভীর সংযোগ বয়ে আনুক।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'ফেরেশতারা যেন তোমার ভালোবাসা রক্ষা করে এবং তোমার ভবিষ্যৎকে পথ দেখায়। আমি প্রার্থনা করি এই ব্যস্ততা তোমার আত্মার মধ্যে আশীর্বাদ এবং গভীর সংযোগ বয়ে আনুক।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের দুজনকেই তোমাদের বাগদান দিবসে অনেক ভালোবাসা এবং আলিঙ্গন পাঠাচ্ছি! সবসময় একসাথে সুখী এবং আশীর্বাদপ্রাপ্ত থেকো!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের দুজনকেই তোমাদের বাগদান দিবসে অনেক ভালোবাসা এবং আলিঙ্গন পাঠাচ্ছি! সবসময় একসাথে সুখী এবং আশীর্বাদপ্রাপ্ত থেকো!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের দুজনকেই তোমাদের বাগদান দিবসে অনেক ভালোবাসা এবং আলিঙ্গন পাঠাচ্ছি! সবসময় একসাথে সুখী এবং আশীর্বাদপ্রাপ্ত থেকো!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'শুভ বাগদান দিবস! তোমরা দুজন একে অপরের সাথে পুরোপুরি মিলে যাও। নতুন যাত্রা শুরু করার সময় তোমাদের সকলের সুখ এবং ভালোবাসা কামনা করি।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('শুভ বাগদান দিবস! তোমরা দুজন একে অপরের সাথে পুরোপুরি মিলে যাও। নতুন যাত্রা শুরু করার সময় তোমাদের সকলের সুখ এবং ভালোবাসা কামনা করি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'শুভ বাগদান দিবস! তোমরা দুজন একে অপরের সাথে পুরোপুরি মিলে যাও। নতুন যাত্রা শুরু করার সময় তোমাদের সকলের সুখ এবং ভালোবাসা কামনা করি।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'শুভ বাগদান দিবস, প্রিয় বন্ধু! আমি আশা করি এবং প্রার্থনা করি তুমি সবসময় সুখী থাকো!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('শুভ বাগদান দিবস, প্রিয় বন্ধু! আমি আশা করি এবং প্রার্থনা করি তুমি সবসময় সুখী থাকো!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'শুভ বাগদান দিবস, প্রিয় বন্ধু! আমি আশা করি এবং প্রার্থনা করি তুমি সবসময় সুখী থাকো!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের দুজনেরই শুভ বাগদান এবং আনন্দময় মুহূর্ত পূর্ণ নতুন জীবনের শুভেচ্ছা।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের দুজনেরই শুভ বাগদান এবং আনন্দময় মুহূর্ত পূর্ণ নতুন জীবনের শুভেচ্ছা।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের দুজনেরই শুভ বাগদান এবং আনন্দময় মুহূর্ত পূর্ণ নতুন জীবনের শুভেচ্ছা।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'বাগদান দুটি আত্মাকে একত্রিত করার প্রক্রিয়া শুরু করে! আগামী জীবন সুন্দর হোক! শুভ বাগদান দিবস!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('বাগদান দুটি আত্মাকে একত্রিত করার প্রক্রিয়া শুরু করে! আগামী জীবন সুন্দর হোক! শুভ বাগদান দিবস!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'বাগদান দুটি আত্মাকে একত্রিত করার প্রক্রিয়া শুরু করে! আগামী জীবন সুন্দর হোক! শুভ বাগদান দিবস!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের দুজনের মতো করে যে একে অপরকে ভালোবাসে এবং দেখে, আমি আর কাউকে ভাবতে পারি না। শুভ বাগদান দিবস, আমি তোমাদের জন্য খুব গর্বিত!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের দুজনের মতো করে যে একে অপরকে ভালোবাসে এবং দেখে, আমি আর কাউকে ভাবতে পারি না। শুভ বাগদান দিবস, আমি তোমাদের জন্য খুব গর্বিত!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের দুজনের মতো করে যে একে অপরকে ভালোবাসে এবং দেখে, আমি আর কাউকে ভাবতে পারি না। শুভ বাগদান দিবস, আমি তোমাদের জন্য খুব গর্বিত!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'শুভ বাগদান দিবস! এখন তোমার চোখে ভালোবাসা আরও উজ্জ্বল হয়ে ওঠে। সারাজীবন একে অপরকে বিরক্ত করার আনন্দ উপভোগ করো!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('শুভ বাগদান দিবস! এখন তোমার চোখে ভালোবাসা আরও উজ্জ্বল হয়ে ওঠে। সারাজীবন একে অপরকে বিরক্ত করার আনন্দ উপভোগ করো!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'শুভ বাগদান দিবস! এখন তোমার চোখে ভালোবাসা আরও উজ্জ্বল হয়ে ওঠে। সারাজীবন একে অপরকে বিরক্ত করার আনন্দ উপভোগ করো!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'আমরা সত্যিই আনন্দিত যে তুমি পরবর্তী পদক্ষেপ নিলে! তোমাদের ভবিষ্যৎ উজ্জ্বল এবং সুখী হোক। শুভকামনা!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('আমরা সত্যিই আনন্দিত যে তুমি পরবর্তী পদক্ষেপ নিলে! তোমাদের ভবিষ্যৎ উজ্জ্বল এবং সুখী হোক। শুভকামনা!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমরা সত্যিই আনন্দিত যে তুমি পরবর্তী পদক্ষেপ নিলে! তোমাদের ভবিষ্যৎ উজ্জ্বল এবং সুখী হোক। শুভকামনা!',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমার বাগদানের খবরটা দারুন। তোমার জন্য আমি খুশি। তোমরা দুজন অসাধারণ মানুষ যারা এক দুর্দান্ত দম্পতি। একে অপরকে ভালোবাসতে থাকো।',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমার বাগদানের খবরটা দারুন। তোমার জন্য আমি খুশি। তোমরা দুজন অসাধারণ মানুষ যারা এক দুর্দান্ত দম্পতি। একে অপরকে ভালোবাসতে থাকো।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার বাগদানের খবরটা দারুন। তোমার জন্য আমি খুশি। তোমরা দুজন অসাধারণ মানুষ যারা এক দুর্দান্ত দম্পতি। একে অপরকে ভালোবাসতে থাকো।',));
              Get.snackbar("Message", "Copied");
            },
          ),
          ReadSms(
            message: 'তোমাদের দুজনকেই একে অপরের সাথে এত পরিপূর্ণ দেখাচ্ছে। মনে হচ্ছে তোমাদের দুজনের মিলন স্বর্গে হয়ে গেছে। তোমাদের দুজনকেই শুভ বাগদান!',
            favoriteButton: (bool isLiked) {  },
            shareButton: () {
              Share.share('তোমাদের দুজনকেই একে অপরের সাথে এত পরিপূর্ণ দেখাচ্ছে। মনে হচ্ছে তোমাদের দুজনের মিলন স্বর্গে হয়ে গেছে। তোমাদের দুজনকেই শুভ বাগদান!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাদের দুজনকেই একে অপরের সাথে এত পরিপূর্ণ দেখাচ্ছে। মনে হচ্ছে তোমাদের দুজনের মিলন স্বর্গে হয়ে গেছে। তোমাদের দুজনকেই শুভ বাগদান!',));
              Get.snackbar("Message", "Copied");
            },
          ),
        ],
      ),
    );
  }
}
*/
