/*
import 'package:clipboard/clipboard.dart';
import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:share_plus/share_plus.dart';
import 'package:wish_message_app/features/common/read_sms.dart';

class NewYearSms extends StatelessWidget {
  const NewYearSms({
    super.key,
  });

  @override
  Widget build(BuildContext context) {
    return Padding(
      padding: const EdgeInsets.all(16),
      child: Column(
        children: [
          ReadSms(
            message: 'শুভ নববর্ষ ২০২৫! সাফল্য, সুখ এবং আশীর্বাদে ভরা নতুন বছর কামনা করি।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শুভ নববর্ষ ২০২৫! সাফল্য, সুখ এবং আশীর্বাদে ভরা নতুন বছর কামনা করি।');
            },
            copyButton: (){
              FlutterClipboard.copy('শুভ নববর্ষ ২০২৫! সাফল্য, সুখ এবং আশীর্বাদে ভরা নতুন বছর কামনা করি।');
            },
          ),
          ReadSms(
            message: 'আপনাকে এবং আপনার পরিবারকে নববর্ষের শুভেচ্ছা! আপনার ঘর যেন নিরন্তর সাফল্য এবং আনন্দে ভরে ওঠে!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আপনাকে এবং আপনার পরিবারকে নববর্ষের শুভেচ্ছা! আপনার ঘর যেন নিরন্তর সাফল্য এবং আনন্দে ভরে ওঠে!');
            },
            copyButton: (){
              FlutterClipboard.copy('আপনাকে এবং আপনার পরিবারকে নববর্ষের শুভেচ্ছা! আপনার ঘর যেন নিরন্তর সাফল্য এবং আনন্দে ভরে ওঠে!');
            },
          ),
          ReadSms(
            message: 'আমাদের পরিবারের পক্ষ থেকে আপনাকে নতুন বছরের শুভেচ্ছা! ২০২৫ সালে আপনার সুস্বাস্থ্য, সমৃদ্ধি এবং সুখ কামনা করছি!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমাদের পরিবারের পক্ষ থেকে আপনাকে নতুন বছরের শুভেচ্ছা! ২০২৫ সালে আপনার সুস্বাস্থ্য, সমৃদ্ধি এবং সুখ কামনা করছি!');
            },
            copyButton: (){
              FlutterClipboard.copy('আমাদের পরিবারের পক্ষ থেকে আপনাকে নতুন বছরের শুভেচ্ছা! ২০২৫ সালে আপনার সুস্বাস্থ্য, সমৃদ্ধি এবং সুখ কামনা করছি!');
            },
          ),
          ReadSms(
            message: 'আমার সকল বন্ধুদের নববর্ষের শুভেচ্ছা! আমি প্রার্থনা করি এবং আশা করি এই বছর সকলের জীবনে শান্তি ও সুখ বয়ে আনুক।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমার সকল বন্ধুদের নববর্ষের শুভেচ্ছা! আমি প্রার্থনা করি এবং আশা করি এই বছর সকলের জীবনে শান্তি ও সুখ বয়ে আনুক।');
            },
            copyButton: (){
              FlutterClipboard.copy('আমার সকল বন্ধুদের নববর্ষের শুভেচ্ছা! আমি প্রার্থনা করি এবং আশা করি এই বছর সকলের জীবনে শান্তি ও সুখ বয়ে আনুক।');
            },
          ),
          ReadSms(
            message: 'তোমাদের চেয়ে গুরুত্বপূর্ণ আর কিছুই নেই। সবসময় আমার পাশে থাকার জন্য ধন্যবাদ। জেনে রাখো আমিও সবসময় তোমাদের পাশে আছি। আমার সকল বন্ধুদের ২০২৫ সালের নববর্ষের শুভেচ্ছা 🍾🎉🌟',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমাদের চেয়ে গুরুত্বপূর্ণ আর কিছুই নেই। সবসময় আমার পাশে থাকার জন্য ধন্যবাদ। জেনে রাখো আমিও সবসময় তোমাদের পাশে আছি। আমার সকল বন্ধুদের ২০২৫ সালের নববর্ষের শুভেচ্ছা 🍾🎉🌟');
            },
            copyButton: (){
              FlutterClipboard.copy('তোমাদের চেয়ে গুরুত্বপূর্ণ আর কিছুই নেই। সবসময় আমার পাশে থাকার জন্য ধন্যবাদ। জেনে রাখো আমিও সবসময় তোমাদের পাশে আছি। আমার সকল বন্ধুদের ২০২৫ সালের নববর্ষের শুভেচ্ছা 🍾🎉🌟');
            },
          ),
          ReadSms(
            message: 'আমার পরিবারের পক্ষ থেকে তোমাদের সকলকে নববর্ষের শুভেচ্ছা! নতুন বছরে তোমাদের সকলের জন্য শুভকামনা রইল। আমি আশা করি আসন্ন বছর তোমাদের জন্য অসাধারণ সুযোগ এবং অভিজ্ঞতায় পূর্ণ হবে।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমার পরিবারের পক্ষ থেকে তোমাদের সকলকে নববর্ষের শুভেচ্ছা! নতুন বছরে তোমাদের সকলের জন্য শুভকামনা রইল। আমি আশা করি আসন্ন বছর তোমাদের জন্য অসাধারণ সুযোগ এবং অভিজ্ঞতায় পূর্ণ হবে।');
            },
            copyButton: (){
              FlutterClipboard.copy('আমার পরিবারের পক্ষ থেকে তোমাদের সকলকে নববর্ষের শুভেচ্ছা! নতুন বছরে তোমাদের সকলের জন্য শুভকামনা রইল। আমি আশা করি আসন্ন বছর তোমাদের জন্য অসাধারণ সুযোগ এবং অভিজ্ঞতায় পূর্ণ হবে।');
            },
          ),
          ReadSms(
            message: 'আমি প্রার্থনা করি নতুন বছর তোমার জীবনের সকল ইতিবাচক দিক নিয়ে আসুক। শুভ নববর্ষ, বন্ধু ✨🌟🍺',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমি প্রার্থনা করি নতুন বছর তোমার জীবনের সকল ইতিবাচক দিক নিয়ে আসুক। শুভ নববর্ষ, বন্ধু ✨🌟🍺');
            },
            copyButton: (){
              FlutterClipboard.copy('আমি প্রার্থনা করি নতুন বছর তোমার জীবনের সকল ইতিবাচক দিক নিয়ে আসুক। শুভ নববর্ষ, বন্ধু ✨🌟🍺');
            },
          ),
          ReadSms(
            message: 'তুমি আমার থেকে দূরে আছো কিন্তু আমার হৃদয় থেকে খুব বেশি দূরে নও। আমি তোমাকে মিস করছি। শুভ নববর্ষ, প্রিয় বন্ধু।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তুমি আমার থেকে দূরে আছো কিন্তু আমার হৃদয় থেকে খুব বেশি দূরে নও। আমি তোমাকে মিস করছি। শুভ নববর্ষ, প্রিয় বন্ধু।');
            },
            copyButton: (){
              FlutterClipboard.copy('তুমি আমার থেকে দূরে আছো কিন্তু আমার হৃদয় থেকে খুব বেশি দূরে নও। আমি তোমাকে মিস করছি। শুভ নববর্ষ, প্রিয় বন্ধু।');
            },
          ),
          ReadSms(
            message: 'শুভ নববর্ষ! আগামী দিনগুলি আপনার দোরগোড়ায় সমৃদ্ধি, আশা এবং সুযোগের বার্তা নিয়ে আসুক!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শুভ নববর্ষ! আগামী দিনগুলি আপনার দোরগোড়ায় সমৃদ্ধি, আশা এবং সুযোগের বার্তা নিয়ে আসুক!');
            },
            copyButton: (){
              FlutterClipboard.copy('শুভ নববর্ষ! আগামী দিনগুলি আপনার দোরগোড়ায় সমৃদ্ধি, আশা এবং সুযোগের বার্তা নিয়ে আসুক!');
            },
          ),
          ReadSms(
            message: 'তারা অনেক, কিন্তু চাঁদ একটাই, বন্ধু অনেক কিন্তু সবচেয়ে প্রিয় সেই যাকে আমি আজ রাতে নতুন বছর আসার সাথে সাথে কামনা করি! তোমাকে শুভ নববর্ষের শুভেচ্ছা!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তারা অনেক, কিন্তু চাঁদ একটাই, বন্ধু অনেক কিন্তু সবচেয়ে প্রিয় সেই যাকে আমি আজ রাতে নতুন বছর আসার সাথে সাথে কামনা করি! তোমাকে শুভ নববর্ষের শুভেচ্ছা!');
            },
            copyButton: (){
              FlutterClipboard.copy('তারা অনেক, কিন্তু চাঁদ একটাই, বন্ধু অনেক কিন্তু সবচেয়ে প্রিয় সেই যাকে আমি আজ রাতে নতুন বছর আসার সাথে সাথে কামনা করি! তোমাকে শুভ নববর্ষের শুভেচ্ছা!');
            },
          ),
          ReadSms(
            message: 'নতুন বছর আমাদের ঐক্যবদ্ধ রাখুক এবং আমাদের মধ্যে বন্ধন আরও দৃঢ় করুক। প্রিয় বন্ধুবান্ধব এবং পরিবার, সবাইকে নতুন বছরের শুভেচ্ছা।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('নতুন বছর আমাদের ঐক্যবদ্ধ রাখুক এবং আমাদের মধ্যে বন্ধন আরও দৃঢ় করুক। প্রিয় বন্ধুবান্ধব এবং পরিবার, সবাইকে নতুন বছরের শুভেচ্ছা।');
            },
            copyButton: (){
              FlutterClipboard.copy('নতুন বছর আমাদের ঐক্যবদ্ধ রাখুক এবং আমাদের মধ্যে বন্ধন আরও দৃঢ় করুক। প্রিয় বন্ধুবান্ধব এবং পরিবার, সবাইকে নতুন বছরের শুভেচ্ছা।');
            },
          ),
          ReadSms(
            message: 'এই বছর আপনার মুখোমুখি হওয়া প্রতিটি চ্যালেঞ্জ আপনাকে সাহস, আশা এবং সাফল্য এনে দিক। আশা করি আপনার সামনে একটি দুর্দান্ত বছর কাটবে। শুভ নববর্ষ।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('এই বছর আপনার মুখোমুখি হওয়া প্রতিটি চ্যালেঞ্জ আপনাকে সাহস, আশা এবং সাফল্য এনে দিক। আশা করি আপনার সামনে একটি দুর্দান্ত বছর কাটবে। শুভ নববর্ষ।');
            },
            copyButton: (){
              FlutterClipboard.copy('এই বছর আপনার মুখোমুখি হওয়া প্রতিটি চ্যালেঞ্জ আপনাকে সাহস, আশা এবং সাফল্য এনে দিক। আশা করি আপনার সামনে একটি দুর্দান্ত বছর কাটবে। শুভ নববর্ষ।');
            },
          ),
          ReadSms(
            message: 'তুমি এই বছর কোটিপতি হও এবং তোমার পাওনা টাকা আমাকে ফেরত দাও! মজা করছি। তোমার নতুন বছর আনন্দময় হোক!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তুমি এই বছর কোটিপতি হও এবং তোমার পাওনা টাকা আমাকে ফেরত দাও! মজা করছি। তোমার নতুন বছর আনন্দময় হোক!');
            },
            copyButton: (){
              FlutterClipboard.copy('তুমি এই বছর কোটিপতি হও এবং তোমার পাওনা টাকা আমাকে ফেরত দাও! মজা করছি। তোমার নতুন বছর আনন্দময় হোক!');
            },
          ),
          ReadSms(
            message: 'এই ১লা জানুয়ারী আপনার জীবনের সেরা ঘটনার সূচনা করুক! আপনাকে এবং আপনার প্রিয়জনদের জন্য শুভ নববর্ষ।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('এই ১লা জানুয়ারী আপনার জীবনের সেরা ঘটনার সূচনা করুক! আপনাকে এবং আপনার প্রিয়জনদের জন্য শুভ নববর্ষ।');
            },
            copyButton: (){
              FlutterClipboard.copy('এই ১লা জানুয়ারী আপনার জীবনের সেরা ঘটনার সূচনা করুক! আপনাকে এবং আপনার প্রিয়জনদের জন্য শুভ নববর্ষ।');
            },
          ),
          ReadSms(
            message: 'নতুন বছর নতুন প্রতিশ্রুতি নিয়ে আসে। তোমরা সকলে নিজ নিজ ক্ষেত্রে বিজয়ী হও! তোমাদের সকলকে নববর্ষের শুভেচ্ছা!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('নতুন বছর নতুন প্রতিশ্রুতি নিয়ে আসে। তোমরা সকলে নিজ নিজ ক্ষেত্রে বিজয়ী হও! তোমাদের সকলকে নববর্ষের শুভেচ্ছা!');
            },
            copyButton: (){
              FlutterClipboard.copy('নতুন বছর নতুন প্রতিশ্রুতি নিয়ে আসে। তোমরা সকলে নিজ নিজ ক্ষেত্রে বিজয়ী হও! তোমাদের সকলকে নববর্ষের শুভেচ্ছা!');
            },
          ),
          ReadSms(
            message: 'আমার প্রিয় বন্ধুকে নববর্ষের শুভেচ্ছা। আমার কাছে আমাদের বন্ধুত্বই একমাত্র মূল্যবান এবং আশা করি আগামী বছরটিও আমাদের বন্ধুত্বের মতোই চমৎকার কাটুক।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমার প্রিয় বন্ধুকে নববর্ষের শুভেচ্ছা। আমার কাছে আমাদের বন্ধুত্বই একমাত্র মূল্যবান এবং আশা করি আগামী বছরটিও আমাদের বন্ধুত্বের মতোই চমৎকার কাটুক।');
            },
            copyButton: (){
              FlutterClipboard.copy('আমার প্রিয় বন্ধুকে নববর্ষের শুভেচ্ছা। আমার কাছে আমাদের বন্ধুত্বই একমাত্র মূল্যবান এবং আশা করি আগামী বছরটিও আমাদের বন্ধুত্বের মতোই চমৎকার কাটুক।');
            },
          ),
          ReadSms(
            message: 'তোমার নতুন বছরের সংকল্প বাস্তবে রূপ লাভ করুক। বছরটি তোমার মতোই মধুর এবং বিশেষ হোক।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমার নতুন বছরের সংকল্প বাস্তবে রূপ লাভ করুক। বছরটি তোমার মতোই মধুর এবং বিশেষ হোক।');
            },
            copyButton: (){
              FlutterClipboard.copy('তোমার নতুন বছরের সংকল্প বাস্তবে রূপ লাভ করুক। বছরটি তোমার মতোই মধুর এবং বিশেষ হোক।');
            },
          ),
          ReadSms(
            message: 'শুভ নববর্ষ, বন্ধুরা! প্রভু তোমাদের অসংখ্য আশীর্বাদ বর্ষণ করুন এবং তোমাদের জন্য সম্ভাবনার দ্বার উন্মুক্ত করুন। যাই ঘটুক না কেন, ঈশ্বরের উপর ছেড়ে দিন, তাহলে সবকিছু ঠিক হয়ে যাবে।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শুভ নববর্ষ, বন্ধুরা! প্রভু তোমাদের অসংখ্য আশীর্বাদ বর্ষণ করুন এবং তোমাদের জন্য সম্ভাবনার দ্বার উন্মুক্ত করুন। যাই ঘটুক না কেন, ঈশ্বরের উপর ছেড়ে দিন, তাহলে সবকিছু ঠিক হয়ে যাবে।');
            },
            copyButton: (){
              FlutterClipboard.copy('শুভ নববর্ষ, বন্ধুরা! প্রভু তোমাদের অসংখ্য আশীর্বাদ বর্ষণ করুন এবং তোমাদের জন্য সম্ভাবনার দ্বার উন্মুক্ত করুন। যাই ঘটুক না কেন, ঈশ্বরের উপর ছেড়ে দিন, তাহলে সবকিছু ঠিক হয়ে যাবে।');
            },
          ),
          ReadSms(
            message: 'আমাদের বন্ধুত্বকে কোন কিছুই দুর্বল করতে পারবে না। আমরা যত বেশি বছর একসাথে কাটাবো, আমাদের বন্ধুত্ব ততই দৃঢ় হবে। শুভ নববর্ষ!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমাদের বন্ধুত্বকে কোন কিছুই দুর্বল করতে পারবে না। আমরা যত বেশি বছর একসাথে কাটাবো, আমাদের বন্ধুত্ব ততই দৃঢ় হবে। শুভ নববর্ষ!');
            },
            copyButton: (){
              FlutterClipboard.copy('আমাদের বন্ধুত্বকে কোন কিছুই দুর্বল করতে পারবে না। আমরা যত বেশি বছর একসাথে কাটাবো, আমাদের বন্ধুত্ব ততই দৃঢ় হবে। শুভ নববর্ষ!');
            },
          ),
          ReadSms(
            message: 'বছর আসে এবং যায় কিন্তু আমরা বন্ধুই থাকব এবং কখনও শত্রু হব না। আমি আপনাকে সুখী এবং সমৃদ্ধ নতুন বছরের শুভেচ্ছা জানাচ্ছি।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('বছর আসে এবং যায় কিন্তু আমরা বন্ধুই থাকব এবং কখনও শত্রু হব না। আমি আপনাকে সুখী এবং সমৃদ্ধ নতুন বছরের শুভেচ্ছা জানাচ্ছি।');
            },
            copyButton: (){
              FlutterClipboard.copy('বছর আসে এবং যায় কিন্তু আমরা বন্ধুই থাকব এবং কখনও শত্রু হব না। আমি আপনাকে সুখী এবং সমৃদ্ধ নতুন বছরের শুভেচ্ছা জানাচ্ছি।');
            },
          ),
          ReadSms(
            message: 'তোমার পাশে থাকা প্রতিটি মুহূর্ত আমার কাছে বিশেষ হয়ে ওঠে, এবং ভবিষ্যতের জন্য আমি তোমাদের সকলের মঙ্গল কামনা করি। তোমাকে এবং তোমার পরিবারকে নববর্ষের শুভেচ্ছা।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমার পাশে থাকা প্রতিটি মুহূর্ত আমার কাছে বিশেষ হয়ে ওঠে, এবং ভবিষ্যতের জন্য আমি তোমাদের সকলের মঙ্গল কামনা করি। তোমাকে এবং তোমার পরিবারকে নববর্ষের শুভেচ্ছা।');
            },
            copyButton: (){
              FlutterClipboard.copy('তোমার পাশে থাকা প্রতিটি মুহূর্ত আমার কাছে বিশেষ হয়ে ওঠে, এবং ভবিষ্যতের জন্য আমি তোমাদের সকলের মঙ্গল কামনা করি। তোমাকে এবং তোমার পরিবারকে নববর্ষের শুভেচ্ছা।');
            },
          ),
          ReadSms(
            message: 'আমাদের মধ্যে গল্প, গোপন কথা, হাসি এবং বেদনা ভাগাভাগি করে নেওয়া হয়েছে। তুমি আমার কাছে কেবল একজন বন্ধুর চেয়ে বেশি কিছু, কারণ তুমি আমাকে তোমার পরিবারের মতো অনুভব করিয়েছো। শুভ নববর্ষ!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমাদের মধ্যে গল্প, গোপন কথা, হাসি এবং বেদনা ভাগাভাগি করে নেওয়া হয়েছে। তুমি আমার কাছে কেবল একজন বন্ধুর চেয়ে বেশি কিছু, কারণ তুমি আমাকে তোমার পরিবারের মতো অনুভব করিয়েছো। শুভ নববর্ষ!');
            },
            copyButton: (){
              FlutterClipboard.copy('আমাদের মধ্যে গল্প, গোপন কথা, হাসি এবং বেদনা ভাগাভাগি করে নেওয়া হয়েছে। তুমি আমার কাছে কেবল একজন বন্ধুর চেয়ে বেশি কিছু, কারণ তুমি আমাকে তোমার পরিবারের মতো অনুভব করিয়েছো। শুভ নববর্ষ!');
            },
          ),
          ReadSms(
            message: 'প্রিয় বন্ধু, তোমাকে আনন্দময় নববর্ষের শুভেচ্ছা। এই বছর তুমি তোমার সমস্ত স্বপ্ন পূরণ করবে এবং নতুন মাইলফলক স্পর্শ করবে।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('প্রিয় বন্ধু, তোমাকে আনন্দময় নববর্ষের শুভেচ্ছা। এই বছর তুমি তোমার সমস্ত স্বপ্ন পূরণ করবে এবং নতুন মাইলফলক স্পর্শ করবে।');
            },
            copyButton: (){
              FlutterClipboard.copy('প্রিয় বন্ধু, তোমাকে আনন্দময় নববর্ষের শুভেচ্ছা। এই বছর তুমি তোমার সমস্ত স্বপ্ন পূরণ করবে এবং নতুন মাইলফলক স্পর্শ করবে।');
            },
          ),
          ReadSms(
            message: 'আমার সবচেয়ে ভালো বন্ধুকে নতুন বছরের শুভেচ্ছা জানাচ্ছি! তোমার উপর সর্বদা সুখের ঝলকানি বয়ে আসুক!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমার সবচেয়ে ভালো বন্ধুকে নতুন বছরের শুভেচ্ছা জানাচ্ছি! তোমার উপর সর্বদা সুখের ঝলকানি বয়ে আসুক!');
            },
            copyButton: (){
              FlutterClipboard.copy('আমার সবচেয়ে ভালো বন্ধুকে নতুন বছরের শুভেচ্ছা জানাচ্ছি! তোমার উপর সর্বদা সুখের ঝলকানি বয়ে আসুক!');
            },
          ),
          ReadSms(
            message: 'শুভ নববর্ষ, প্রিয় বন্ধু! নতুন বছর যে নতুন সম্ভাবনা নিয়ে আসে, নতুন অভিজ্ঞতা অর্জনের জন্য এবং তোমার সাথে নতুন স্মৃতি তৈরি করার জন্য আমি অধীর আগ্রহে অপেক্ষা করছি।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শুভ নববর্ষ, প্রিয় বন্ধু! নতুন বছর যে নতুন সম্ভাবনা নিয়ে আসে, নতুন অভিজ্ঞতা অর্জনের জন্য এবং তোমার সাথে নতুন স্মৃতি তৈরি করার জন্য আমি অধীর আগ্রহে অপেক্ষা করছি।');
            },
            copyButton: (){
              FlutterClipboard.copy('শুভ নববর্ষ, প্রিয় বন্ধু! নতুন বছর যে নতুন সম্ভাবনা নিয়ে আসে, নতুন অভিজ্ঞতা অর্জনের জন্য এবং তোমার সাথে নতুন স্মৃতি তৈরি করার জন্য আমি অধীর আগ্রহে অপেক্ষা করছি।');
            },
          ),
          ReadSms(
            message: 'শুভ নববর্ষ আমার সবচেয়ে প্রিয় বন্ধু। তোমাকে এবং তোমার পরিবারকে উষ্ণ শুভেচ্ছা জানাচ্ছি।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শুভ নববর্ষ আমার সবচেয়ে প্রিয় বন্ধু। তোমাকে এবং তোমার পরিবারকে উষ্ণ শুভেচ্ছা জানাচ্ছি।');
            },
            copyButton: (){
              FlutterClipboard.copy('শুভ নববর্ষ আমার সবচেয়ে প্রিয় বন্ধু। তোমাকে এবং তোমার পরিবারকে উষ্ণ শুভেচ্ছা জানাচ্ছি।');
            },
          ),
          ReadSms(
            message: 'আমার প্রিয় বন্ধু এবং অপরাধের অংশীদার, নববর্ষের শুভেচ্ছা। দয়া করে পাশে থাকুন এবং আমার দিনগুলিকে আনন্দে ভরে তুলুন।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমার প্রিয় বন্ধু এবং অপরাধের অংশীদার, নববর্ষের শুভেচ্ছা। দয়া করে পাশে থাকুন এবং আমার দিনগুলিকে আনন্দে ভরে তুলুন।');
            },
            copyButton: (){
              FlutterClipboard.copy('আমার প্রিয় বন্ধু এবং অপরাধের অংশীদার, নববর্ষের শুভেচ্ছা। দয়া করে পাশে থাকুন এবং আমার দিনগুলিকে আনন্দে ভরে তুলুন।');
            },
          ),
          ReadSms(
            message: 'তোমার আর তোমার পরিবারের জন্য আমি শুধু ভালো কিছু কামনা করি। শুভ নববর্ষ, প্রিয়তম বন্ধু। এই নতুন বছরে তোমাকে অনেক মিস করছি!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমার আর তোমার পরিবারের জন্য আমি শুধু ভালো কিছু কামনা করি। শুভ নববর্ষ, প্রিয়তম বন্ধু। এই নতুন বছরে তোমাকে অনেক মিস করছি!');
            },
            copyButton: (){
              FlutterClipboard.copy('তোমার আর তোমার পরিবারের জন্য আমি শুধু ভালো কিছু কামনা করি। শুভ নববর্ষ, প্রিয়তম বন্ধু। এই নতুন বছরে তোমাকে অনেক মিস করছি!');
            },
          ),
          ReadSms(
            message: 'নতুন সম্ভাবনার সাথে নতুন বছরের জন্য তোমার গ্লাসটি তুলো। আমার প্রিয় সেরা বন্ধু, তোমাকে আনন্দময় নতুন বছরের শুভেচ্ছা।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('নতুন সম্ভাবনার সাথে নতুন বছরের জন্য তোমার গ্লাসটি তুলো। আমার প্রিয় সেরা বন্ধু, তোমাকে আনন্দময় নতুন বছরের শুভেচ্ছা।');
            },
            copyButton: (){
              FlutterClipboard.copy('নতুন সম্ভাবনার সাথে নতুন বছরের জন্য তোমার গ্লাসটি তুলো। আমার প্রিয় সেরা বন্ধু, তোমাকে আনন্দময় নতুন বছরের শুভেচ্ছা।');
            },
          ),
          ReadSms(
            message: 'তুমি জানো তোমার আর নতুন বছরের মধ্যে কী মিল? দুটোই আমার জন্য আশা আর সুখ বয়ে আনে! শুভ নববর্ষ, প্রিয় বন্ধু।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তুমি জানো তোমার আর নতুন বছরের মধ্যে কী মিল? দুটোই আমার জন্য আশা আর সুখ বয়ে আনে! শুভ নববর্ষ, প্রিয় বন্ধু।');
            },
            copyButton: (){
              FlutterClipboard.copy('তুমি জানো তোমার আর নতুন বছরের মধ্যে কী মিল? দুটোই আমার জন্য আশা আর সুখ বয়ে আনে! শুভ নববর্ষ, প্রিয় বন্ধু।');
            },
          ),
          ReadSms(
            message: 'শুভ নববর্ষ, আমার প্রিয়তম বন্ধু। আগামী বছর তোমার জীবন বিস্ময় এবং সাফল্যে পূর্ণ হবে কারণ আমি ঈশ্বরের কাছে তোমার জন্য বিশেষ প্রার্থনা করছি। তোমাকে ভালোবাসি।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শুভ নববর্ষ, আমার প্রিয়তম বন্ধু। আগামী বছর তোমার জীবন বিস্ময় এবং সাফল্যে পূর্ণ হবে কারণ আমি ঈশ্বরের কাছে তোমার জন্য বিশেষ প্রার্থনা করছি। তোমাকে ভালোবাসি।');
            },
            copyButton: (){
              FlutterClipboard.copy('শুভ নববর্ষ, আমার প্রিয়তম বন্ধু। আগামী বছর তোমার জীবন বিস্ময় এবং সাফল্যে পূর্ণ হবে কারণ আমি ঈশ্বরের কাছে তোমার জন্য বিশেষ প্রার্থনা করছি। তোমাকে ভালোবাসি।');
            },
          ),
          ReadSms(
            message: 'প্রিয়তমা, তোমাকে নববর্ষের শুভেচ্ছা। আমার জীবনের প্রতিটি উত্থান-পতনে আমার পাশে থাকার জন্য এবং আমার সার্বক্ষণিক সমর্থনের ব্যবস্থা হওয়ার জন্য তোমাকে ধন্যবাদ।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('প্রিয়তমা, তোমাকে নববর্ষের শুভেচ্ছা। আমার জীবনের প্রতিটি উত্থান-পতনে আমার পাশে থাকার জন্য এবং আমার সার্বক্ষণিক সমর্থনের ব্যবস্থা হওয়ার জন্য তোমাকে ধন্যবাদ।');
            },
            copyButton: (){
              FlutterClipboard.copy('প্রিয়তমা, তোমাকে নববর্ষের শুভেচ্ছা। আমার জীবনের প্রতিটি উত্থান-পতনে আমার পাশে থাকার জন্য এবং আমার সার্বক্ষণিক সমর্থনের ব্যবস্থা হওয়ার জন্য তোমাকে ধন্যবাদ।');
            },
          ),
          ReadSms(
            message: 'শুভ নববর্ষ, বেস্টফ্রেন্ড! আমার জীবনে যখন তোমার মতো নির্ভরযোগ্য উপস্থিতি থাকে, তখন সবচেয়ে কঠিন সময়গুলোও আনন্দের লাগে!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শুভ নববর্ষ, বেস্টফ্রেন্ড! আমার জীবনে যখন তোমার মতো নির্ভরযোগ্য উপস্থিতি থাকে, তখন সবচেয়ে কঠিন সময়গুলোও আনন্দের লাগে!');
            },
            copyButton: (){
              FlutterClipboard.copy('শুভ নববর্ষ, বেস্টফ্রেন্ড! আমার জীবনে যখন তোমার মতো নির্ভরযোগ্য উপস্থিতি থাকে, তখন সবচেয়ে কঠিন সময়গুলোও আনন্দের লাগে!');
            },
          ),
          ReadSms(
            message: 'নতুন ঋতু তোমার সকল দুশ্চিন্তা ধুয়ে মুছে তোমার জন্য আনন্দ ও আরও ভালো দিন বয়ে আনুক। প্রতিটি সূর্যকিরণ এবং প্রতিটি তুষারকণা তোমার উজ্জ্বল প্রচেষ্টার সাক্ষী হোক। শুভ নববর্ষ।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('নতুন ঋতু তোমার সকল দুশ্চিন্তা ধুয়ে মুছে তোমার জন্য আনন্দ ও আরও ভালো দিন বয়ে আনুক। প্রতিটি সূর্যকিরণ এবং প্রতিটি তুষারকণা তোমার উজ্জ্বল প্রচেষ্টার সাক্ষী হোক। শুভ নববর্ষ।');
            },
            copyButton: (){
              FlutterClipboard.copy('নতুন ঋতু তোমার সকল দুশ্চিন্তা ধুয়ে মুছে তোমার জন্য আনন্দ ও আরও ভালো দিন বয়ে আনুক। প্রতিটি সূর্যকিরণ এবং প্রতিটি তুষারকণা তোমার উজ্জ্বল প্রচেষ্টার সাক্ষী হোক। শুভ নববর্ষ।');
            },
          ),
          ReadSms(
            message: 'নববর্ষের আগের দিন তোমার সকল ঝামেলার অবসান ঘটাও এবং তোমার জীবনকে অসীম আনন্দে ভরে দাও। পৃথিবীর সকল সুন্দর জিনিসের জন্য শুভকামনা, প্রিয় বন্ধু।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('নববর্ষের আগের দিন তোমার সকল ঝামেলার অবসান ঘটাও এবং তোমার জীবনকে অসীম আনন্দে ভরে দাও। পৃথিবীর সকল সুন্দর জিনিসের জন্য শুভকামনা, প্রিয় বন্ধু।');
            },
            copyButton: (){
              FlutterClipboard.copy('নববর্ষের আগের দিন তোমার সকল ঝামেলার অবসান ঘটাও এবং তোমার জীবনকে অসীম আনন্দে ভরে দাও। পৃথিবীর সকল সুন্দর জিনিসের জন্য শুভকামনা, প্রিয় বন্ধু।');
            },
          ),
          ReadSms(
            message: 'বন্ধু হলো এমন একজন যে তোমাকে সাহায্য করে যখন তুমি খারাপ থাকো! আর যদি তারা তোমাকে তুলতে না পারে, তাহলে তারা তোমার পাশে শুয়ে তোমার কথা শুনবে। আর তুমি তাদের প্রতি সদয় হও, আমার প্রিয় বন্ধু। শুভ নববর্ষ!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('বন্ধু হলো এমন একজন যে তোমাকে সাহায্য করে যখন তুমি খারাপ থাকো! আর যদি তারা তোমাকে তুলতে না পারে, তাহলে তারা তোমার পাশে শুয়ে তোমার কথা শুনবে। আর তুমি তাদের প্রতি সদয় হও, আমার প্রিয় বন্ধু। শুভ নববর্ষ!');
            },
            copyButton: (){
              FlutterClipboard.copy('বন্ধু হলো এমন একজন যে তোমাকে সাহায্য করে যখন তুমি খারাপ থাকো! আর যদি তারা তোমাকে তুলতে না পারে, তাহলে তারা তোমার পাশে শুয়ে তোমার কথা শুনবে। আর তুমি তাদের প্রতি সদয় হও, আমার প্রিয় বন্ধু। শুভ নববর্ষ!');
            },
          ),
          ReadSms(
            message: 'আমার জীবন ছিল একটা ফাঁকা ক্যানভাস, তোমাদের মতো বন্ধুরাই এতে রঙ যোগ করেছে। সবসময় আমার পাশে থাকার জন্য ধন্যবাদ এবং তোমাকে নববর্ষের শুভেচ্ছা!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমার জীবন ছিল একটা ফাঁকা ক্যানভাস, তোমাদের মতো বন্ধুরাই এতে রঙ যোগ করেছে। সবসময় আমার পাশে থাকার জন্য ধন্যবাদ এবং তোমাকে নববর্ষের শুভেচ্ছা!');
            },
            copyButton: (){
              FlutterClipboard.copy('আমার জীবন ছিল একটা ফাঁকা ক্যানভাস, তোমাদের মতো বন্ধুরাই এতে রঙ যোগ করেছে। সবসময় আমার পাশে থাকার জন্য ধন্যবাদ এবং তোমাকে নববর্ষের শুভেচ্ছা!');
            },
          ),
          ReadSms(
            message: 'তোমার সাথে আমি কত সময় কাটাই তা বিবেচ্য নয়; এটা কখনোই যথেষ্ট বলে মনে হয় না। তোমার সঙ্গ আসক্তিকর। তোমাকে নতুন বছরের শুভেচ্ছা!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমার সাথে আমি কত সময় কাটাই তা বিবেচ্য নয়; এটা কখনোই যথেষ্ট বলে মনে হয় না। তোমার সঙ্গ আসক্তিকর। তোমাকে নতুন বছরের শুভেচ্ছা!');
            },
            copyButton: (){
              FlutterClipboard.copy('তোমার সাথে আমি কত সময় কাটাই তা বিবেচ্য নয়; এটা কখনোই যথেষ্ট বলে মনে হয় না। তোমার সঙ্গ আসক্তিকর। তোমাকে নতুন বছরের শুভেচ্ছা!');
            },
          ),
          ReadSms(
            message: 'শুভ নববর্ষ! আমি তোমাকে হৃদয়ের অন্তঃস্থল থেকে ভালোবাসা এবং উষ্ণ শুভেচ্ছা পাঠাচ্ছি। তোমাকে মিস করছি।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শুভ নববর্ষ! আমি তোমাকে হৃদয়ের অন্তঃস্থল থেকে ভালোবাসা এবং উষ্ণ শুভেচ্ছা পাঠাচ্ছি। তোমাকে মিস করছি।');
            },
            copyButton: (){
              FlutterClipboard.copy('শুভ নববর্ষ! আমি তোমাকে হৃদয়ের অন্তঃস্থল থেকে ভালোবাসা এবং উষ্ণ শুভেচ্ছা পাঠাচ্ছি। তোমাকে মিস করছি।');
            },
          ),
          ReadSms(
            message: 'তোমাকে এবং তোমার পরিবারকে নতুন বছরের শুভেচ্ছা! তোমাকে আমার জীবনে পাঠানোর জন্য আমি চিরকাল প্রভুর কাছে কৃতজ্ঞ। ঈশ্বর তোমাকে আশীর্বাদ করুন।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমাকে এবং তোমার পরিবারকে নতুন বছরের শুভেচ্ছা! তোমাকে আমার জীবনে পাঠানোর জন্য আমি চিরকাল প্রভুর কাছে কৃতজ্ঞ। ঈশ্বর তোমাকে আশীর্বাদ করুন।');
            },
            copyButton: (){
              FlutterClipboard.copy('তোমাকে এবং তোমার পরিবারকে নতুন বছরের শুভেচ্ছা! তোমাকে আমার জীবনে পাঠানোর জন্য আমি চিরকাল প্রভুর কাছে কৃতজ্ঞ। ঈশ্বর তোমাকে আশীর্বাদ করুন।');
            },
          ),
          ReadSms(
            message: 'তোমাকেও নতুন বছরের শুভেচ্ছা! এই বছরটি ভালোবাসা, সুখ এবং সাফল্যে ভরে উঠুক।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমাকেও নতুন বছরের শুভেচ্ছা! এই বছরটি ভালোবাসা, সুখ এবং সাফল্যে ভরে উঠুক।');
            },
            copyButton: (){
              FlutterClipboard.copy('তোমাকেও নতুন বছরের শুভেচ্ছা! এই বছরটি ভালোবাসা, সুখ এবং সাফল্যে ভরে উঠুক।');
            },
          ),
          ReadSms(
            message: 'আমার জীবনে তোমাকে পেয়ে আমি কৃতজ্ঞ যে তুমি নতুন বছরের উষ্ণ শুভেচ্ছা পাঠাতে ভালোবাসো। এই বছরটা তোমার সাথে ভালো ব্যবহার করুক।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমার জীবনে তোমাকে পেয়ে আমি কৃতজ্ঞ যে তুমি নতুন বছরের উষ্ণ শুভেচ্ছা পাঠাতে ভালোবাসো। এই বছরটা তোমার সাথে ভালো ব্যবহার করুক।');
            },
            copyButton: (){
              FlutterClipboard.copy('আমার জীবনে তোমাকে পেয়ে আমি কৃতজ্ঞ যে তুমি নতুন বছরের উষ্ণ শুভেচ্ছা পাঠাতে ভালোবাসো। এই বছরটা তোমার সাথে ভালো ব্যবহার করুক।');
            },
          ),
          ReadSms(
            message: 'আপনাদের উষ্ণ শুভেচ্ছায় এই বছর শুরু করতে পেরে আমি আনন্দিত। ধন্যবাদ, এবং আপনাকেও নতুন বছরের শুভেচ্ছা!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আপনাদের উষ্ণ শুভেচ্ছায় এই বছর শুরু করতে পেরে আমি আনন্দিত। ধন্যবাদ, এবং আপনাকেও নতুন বছরের শুভেচ্ছা!');
            },
            copyButton: (){
              FlutterClipboard.copy('আপনাদের উষ্ণ শুভেচ্ছায় এই বছর শুরু করতে পেরে আমি আনন্দিত। ধন্যবাদ, এবং আপনাকেও নতুন বছরের শুভেচ্ছা!');
            },
          ),
          ReadSms(
            message: 'তোমার উপহারটি বছরটিকে ইতিবাচকভাবে শুরু করার জন্য একটি দুর্দান্ত উপায় ছিল। তোমার সুচিন্তিত পদক্ষেপ এবং তোমার সুন্দর নববর্ষের শুভেচ্ছার জন্য ধন্যবাদ। তোমার আগামী বছরটি সুন্দর হোক এই কামনা করি।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমার উপহারটি বছরটিকে ইতিবাচকভাবে শুরু করার জন্য একটি দুর্দান্ত উপায় ছিল। তোমার সুচিন্তিত পদক্ষেপ এবং তোমার সুন্দর নববর্ষের শুভেচ্ছার জন্য ধন্যবাদ। তোমার আগামী বছরটি সুন্দর হোক এই কামনা করি।');
            },
            copyButton: (){
              FlutterClipboard.copy('তোমার উপহারটি বছরটিকে ইতিবাচকভাবে শুরু করার জন্য একটি দুর্দান্ত উপায় ছিল। তোমার সুচিন্তিত পদক্ষেপ এবং তোমার সুন্দর নববর্ষের শুভেচ্ছার জন্য ধন্যবাদ। তোমার আগামী বছরটি সুন্দর হোক এই কামনা করি।');
            },
          ),
          ReadSms(
            message: 'তোমাকেও নতুন বছরের শুভেচ্ছা! আসুন সময়ের এই ফাঁকা ক্যানভাসে সাফল্য, আনন্দ এবং স্থায়ী স্মৃতির প্রাণবন্ত রঙে রাঙানোর অভিপ্রায়ে পা রাখি।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমাকেও নতুন বছরের শুভেচ্ছা! আসুন সময়ের এই ফাঁকা ক্যানভাসে সাফল্য, আনন্দ এবং স্থায়ী স্মৃতির প্রাণবন্ত রঙে রাঙানোর অভিপ্রায়ে পা রাখি।');
            },
            copyButton: (){
              FlutterClipboard.copy('তোমাকেও নতুন বছরের শুভেচ্ছা! আসুন সময়ের এই ফাঁকা ক্যানভাসে সাফল্য, আনন্দ এবং স্থায়ী স্মৃতির প্রাণবন্ত রঙে রাঙানোর অভিপ্রায়ে পা রাখি।');
            },
          ),
          ReadSms(
            message: 'তুমি সবসময় আমার প্রতি এত দয়ালু এবং তোমার আন্তরিক শুভেচ্ছা পেয়ে আমি খুব খুশি। আমি আশা করি তোমার নতুন বছরটিও চমৎকার হবে।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তুমি সবসময় আমার প্রতি এত দয়ালু এবং তোমার আন্তরিক শুভেচ্ছা পেয়ে আমি খুব খুশি। আমি আশা করি তোমার নতুন বছরটিও চমৎকার হবে।');
            },
            copyButton: (){
              FlutterClipboard.copy('তুমি সবসময় আমার প্রতি এত দয়ালু এবং তোমার আন্তরিক শুভেচ্ছা পেয়ে আমি খুব খুশি। আমি আশা করি তোমার নতুন বছরটিও চমৎকার হবে।');
            },
          ),
          ReadSms(
            message: 'তোমার সুচিন্তিত শুভেচ্ছা আমার হৃদয় ছুঁয়ে গেল। সুখ, সুস্বাস্থ্য এবং প্রিয় মুহূর্তগুলিতে ভরা একটি বছরের জন্য শুভেচ্ছা। শুভ নববর্ষ!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমার সুচিন্তিত শুভেচ্ছা আমার হৃদয় ছুঁয়ে গেল। সুখ, সুস্বাস্থ্য এবং প্রিয় মুহূর্তগুলিতে ভরা একটি বছরের জন্য শুভেচ্ছা। শুভ নববর্ষ!');
            },
            copyButton: (){
              FlutterClipboard.copy('তোমার সুচিন্তিত শুভেচ্ছা আমার হৃদয় ছুঁয়ে গেল। সুখ, সুস্বাস্থ্য এবং প্রিয় মুহূর্তগুলিতে ভরা একটি বছরের জন্য শুভেচ্ছা। শুভ নববর্ষ!');
            },
          ),
          ReadSms(
            message: 'তোমার শুভেচ্ছার জন্য ধন্যবাদ। বন্ধু, তুমি সত্যিই আমার দিনটা সুন্দর করে তুলেছো। আগামী বছরটা সুন্দর কাটুক, আর তুমি যে অসাধারণ বন্ধু, সেইভাবেই থাকো।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমার শুভেচ্ছার জন্য ধন্যবাদ। বন্ধু, তুমি সত্যিই আমার দিনটা সুন্দর করে তুলেছো। আগামী বছরটা সুন্দর কাটুক, আর তুমি যে অসাধারণ বন্ধু, সেইভাবেই থাকো।');
            },
            copyButton: (){
              FlutterClipboard.copy('তোমার শুভেচ্ছার জন্য ধন্যবাদ। বন্ধু, তুমি সত্যিই আমার দিনটা সুন্দর করে তুলেছো। আগামী বছরটা সুন্দর কাটুক, আর তুমি যে অসাধারণ বন্ধু, সেইভাবেই থাকো।');
            },
          ),
          ReadSms(
            message: 'তোমার ভালোবাসার কথাগুলোর জন্য আমি কৃতজ্ঞ এবং তোমাকে আমার জীবনে পেয়ে আমি ধন্য। এই বছরটা তোমার হৃদয়ের মতোই উজ্জ্বল এবং সুন্দর হোক। শুভ নববর্ষ!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমার ভালোবাসার কথাগুলোর জন্য আমি কৃতজ্ঞ এবং তোমাকে আমার জীবনে পেয়ে আমি ধন্য। এই বছরটা তোমার হৃদয়ের মতোই উজ্জ্বল এবং সুন্দর হোক। শুভ নববর্ষ!');
            },
            copyButton: (){
              FlutterClipboard.copy('তোমার ভালোবাসার কথাগুলোর জন্য আমি কৃতজ্ঞ এবং তোমাকে আমার জীবনে পেয়ে আমি ধন্য। এই বছরটা তোমার হৃদয়ের মতোই উজ্জ্বল এবং সুন্দর হোক। শুভ নববর্ষ!');
            },
          ),
          ReadSms(
            message: 'আসন্ন বছরের জন্য তোমাকে ভালোবাসা এবং সুখ পাঠাচ্ছি। তোমার নববর্ষের শুভেচ্ছা আমাকে অভিভূত করেছে, অনেক ধন্যবাদ।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আসন্ন বছরের জন্য তোমাকে ভালোবাসা এবং সুখ পাঠাচ্ছি। তোমার নববর্ষের শুভেচ্ছা আমাকে অভিভূত করেছে, অনেক ধন্যবাদ।');
            },
            copyButton: (){
              FlutterClipboard.copy('আসন্ন বছরের জন্য তোমাকে ভালোবাসা এবং সুখ পাঠাচ্ছি। তোমার নববর্ষের শুভেচ্ছা আমাকে অভিভূত করেছে, অনেক ধন্যবাদ।');
            },
          ),
          ReadSms(
            message: 'তোমার মিষ্টি নববর্ষের শুভেচ্ছা পেয়ে আমি আনন্দে ভরে গেলাম। আমার পাশে থাকার জন্য ধন্যবাদ, এবং শুভ নববর্ষ।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমার মিষ্টি নববর্ষের শুভেচ্ছা পেয়ে আমি আনন্দে ভরে গেলাম। আমার পাশে থাকার জন্য ধন্যবাদ, এবং শুভ নববর্ষ।');
            },
            copyButton: (){
              FlutterClipboard.copy('তোমার মিষ্টি নববর্ষের শুভেচ্ছা পেয়ে আমি আনন্দে ভরে গেলাম। আমার পাশে থাকার জন্য ধন্যবাদ, এবং শুভ নববর্ষ।');
            },
          ),
          ReadSms(
            message: 'সর্বকালের সেরা শিক্ষককে নববর্ষের শুভেচ্ছা! এই বছরটি আনন্দ, সুখ এবং সাফল্যে ভরে উঠুক।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('সর্বকালের সেরা শিক্ষককে নববর্ষের শুভেচ্ছা! এই বছরটি আনন্দ, সুখ এবং সাফল্যে ভরে উঠুক।');
            },
            copyButton: (){
              FlutterClipboard.copy('সর্বকালের সেরা শিক্ষককে নববর্ষের শুভেচ্ছা! এই বছরটি আনন্দ, সুখ এবং সাফল্যে ভরে উঠুক।');
            },
          ),
          ReadSms(
            message: 'নতুন বছরের প্রাক্কালে আমার আন্তরিক ভালোবাসা গ্রহণ করুন! আপনার মতো একজন পরামর্শদাতা পেয়ে আমি সবসময়ই অত্যন্ত ধন্য বোধ করেছি!! শুভ নববর্ষ, প্রিয় শিক্ষক!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('নতুন বছরের প্রাক্কালে আমার আন্তরিক ভালোবাসা গ্রহণ করুন! আপনার মতো একজন পরামর্শদাতা পেয়ে আমি সবসময়ই অত্যন্ত ধন্য বোধ করেছি!! শুভ নববর্ষ, প্রিয় শিক্ষক!');
            },
            copyButton: (){
              FlutterClipboard.copy('নতুন বছরের প্রাক্কালে আমার আন্তরিক ভালোবাসা গ্রহণ করুন! আপনার মতো একজন পরামর্শদাতা পেয়ে আমি সবসময়ই অত্যন্ত ধন্য বোধ করেছি!! শুভ নববর্ষ, প্রিয় শিক্ষক!');
            },
          ),
          ReadSms(
            message: 'একজন অসাধারণ শিক্ষক হওয়ার জন্য আপনাকে ধন্যবাদ। আপনার নতুন বছরের শুভকামনা, সুস্থতা এবং সমৃদ্ধি কামনা করছি।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('একজন অসাধারণ শিক্ষক হওয়ার জন্য আপনাকে ধন্যবাদ। আপনার নতুন বছরের শুভকামনা, সুস্থতা এবং সমৃদ্ধি কামনা করছি।');
            },
            copyButton: (){
              FlutterClipboard.copy('একজন অসাধারণ শিক্ষক হওয়ার জন্য আপনাকে ধন্যবাদ। আপনার নতুন বছরের শুভকামনা, সুস্থতা এবং সমৃদ্ধি কামনা করছি।');
            },
          ),
          ReadSms(
            message: 'আমার জীবনের সেরা শিক্ষককে নতুন বছরের শুভেচ্ছা! জীবন সম্পর্কে আপনার শিক্ষা এবং শিক্ষা আমাকে আমাদের সমাজের প্রাপ্য মানুষ হতে সক্ষম করেছে! আপনিই সেরা!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমার জীবনের সেরা শিক্ষককে নতুন বছরের শুভেচ্ছা! জীবন সম্পর্কে আপনার শিক্ষা এবং শিক্ষা আমাকে আমাদের সমাজের প্রাপ্য মানুষ হতে সক্ষম করেছে! আপনিই সেরা!');
            },
            copyButton: (){
              FlutterClipboard.copy('আমার জীবনের সেরা শিক্ষককে নতুন বছরের শুভেচ্ছা! জীবন সম্পর্কে আপনার শিক্ষা এবং শিক্ষা আমাকে আমাদের সমাজের প্রাপ্য মানুষ হতে সক্ষম করেছে! আপনিই সেরা!');
            },
          ),
          ReadSms(
            message: 'শিক্ষার্থীদের জীবনে ইতিবাচক প্রভাব ফেলার আরেকটি বছর শুরু হল। শুভ নববর্ষ!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শিক্ষার্থীদের জীবনে ইতিবাচক প্রভাব ফেলার আরেকটি বছর শুরু হল। শুভ নববর্ষ!');
            },
            copyButton: (){
              FlutterClipboard.copy('শিক্ষার্থীদের জীবনে ইতিবাচক প্রভাব ফেলার আরেকটি বছর শুরু হল। শুভ নববর্ষ!');
            },
          ),
          ReadSms(
            message: 'সেই পরামর্শদাতাকে যিনি আমাকে মাটির পিণ্ড থেকে ভাস্কর্যে রূপ দিয়েছেন! আমি সবচেয়ে ভাগ্যবান যে আপনার মতো একজন পথপ্রদর্শক পেয়েছি যিনি আমাকে একেবারে শুরু থেকে শিক্ষা দিয়েছিলেন! শুভ নববর্ষ, আমার প্রিয় শিক্ষক!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('সেই পরামর্শদাতাকে যিনি আমাকে মাটির পিণ্ড থেকে ভাস্কর্যে রূপ দিয়েছেন! আমি সবচেয়ে ভাগ্যবান যে আপনার মতো একজন পথপ্রদর্শক পেয়েছি যিনি আমাকে একেবারে শুরু থেকে শিক্ষা দিয়েছিলেন! শুভ নববর্ষ, আমার প্রিয় শিক্ষক!');
            },
            copyButton: (){
              FlutterClipboard.copy('সেই পরামর্শদাতাকে যিনি আমাকে মাটির পিণ্ড থেকে ভাস্কর্যে রূপ দিয়েছেন! আমি সবচেয়ে ভাগ্যবান যে আপনার মতো একজন পথপ্রদর্শক পেয়েছি যিনি আমাকে একেবারে শুরু থেকে শিক্ষা দিয়েছিলেন! শুভ নববর্ষ, আমার প্রিয় শিক্ষক!');
            },
          ),
          ReadSms(
            message: 'তোমার নতুন বছর তোমার মনের মতোই উজ্জ্বল হোক। শুভ নববর্ষ, শিক্ষক!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমার নতুন বছর তোমার মনের মতোই উজ্জ্বল হোক। শুভ নববর্ষ, শিক্ষক!');
            },
            copyButton: (){
              FlutterClipboard.copy('তোমার নতুন বছর তোমার মনের মতোই উজ্জ্বল হোক। শুভ নববর্ষ, শিক্ষক!');
            },
          ),
          ReadSms(
            message: 'সেই অসাধারণ শিক্ষককে নতুন বছরের শুভেচ্ছা, যিনি ছদ্মবেশে সূর্যের আলো আমাকে অন্ধকারে চলতে সাহায্য করেছিলেন! আপনার শিক্ষা সর্বদা আমার পথপ্রদর্শক হবে! সবকিছুর জন্য আপনাকে ধন্যবাদ!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('সেই অসাধারণ শিক্ষককে নতুন বছরের শুভেচ্ছা, যিনি ছদ্মবেশে সূর্যের আলো আমাকে অন্ধকারে চলতে সাহায্য করেছিলেন! আপনার শিক্ষা সর্বদা আমার পথপ্রদর্শক হবে! সবকিছুর জন্য আপনাকে ধন্যবাদ!');
            },
            copyButton: (){
              FlutterClipboard.copy('সেই অসাধারণ শিক্ষককে নতুন বছরের শুভেচ্ছা, যিনি ছদ্মবেশে সূর্যের আলো আমাকে অন্ধকারে চলতে সাহায্য করেছিলেন! আপনার শিক্ষা সর্বদা আমার পথপ্রদর্শক হবে! সবকিছুর জন্য আপনাকে ধন্যবাদ!');
            },
          ),
          ReadSms(
            message: 'একজন অসাধারণ শিক্ষককে নববর্ষের শুভেচ্ছা। আমার শিক্ষাজীবনে এত ইতিবাচক প্রভাব ফেলার জন্য আপনাকে ধন্যবাদ। আপনার বছরটি আনন্দে ভরে উঠুক।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('একজন অসাধারণ শিক্ষককে নববর্ষের শুভেচ্ছা। আমার শিক্ষাজীবনে এত ইতিবাচক প্রভাব ফেলার জন্য আপনাকে ধন্যবাদ। আপনার বছরটি আনন্দে ভরে উঠুক।');
            },
            copyButton: (){
              FlutterClipboard.copy('একজন অসাধারণ শিক্ষককে নববর্ষের শুভেচ্ছা। আমার শিক্ষাজীবনে এত ইতিবাচক প্রভাব ফেলার জন্য আপনাকে ধন্যবাদ। আপনার বছরটি আনন্দে ভরে উঠুক।');
            },
          ),
          ReadSms(
            message: 'শিক্ষক, আপনার জন্য শুভকামনা রইলো। আপনি আপনার ছাত্রছাত্রীদের জন্য আশীর্বাদ এবং আমরা আপনাকে পেয়ে ভাগ্যবান। ঈশ্বর আপনার মঙ্গল করুন।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শিক্ষক, আপনার জন্য শুভকামনা রইলো। আপনি আপনার ছাত্রছাত্রীদের জন্য আশীর্বাদ এবং আমরা আপনাকে পেয়ে ভাগ্যবান। ঈশ্বর আপনার মঙ্গল করুন।');
            },
            copyButton: (){
              FlutterClipboard.copy('শিক্ষক, আপনার জন্য শুভকামনা রইলো। আপনি আপনার ছাত্রছাত্রীদের জন্য আশীর্বাদ এবং আমরা আপনাকে পেয়ে ভাগ্যবান। ঈশ্বর আপনার মঙ্গল করুন।');
            },
          ),
          ReadSms(
            message: 'শুভ নববর্ষ! পাতা উল্টানোর এবং অসাধারণ কিছু লেখার সময় এসেছে।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শুভ নববর্ষ! পাতা উল্টানোর এবং অসাধারণ কিছু লেখার সময় এসেছে।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'শুভ নববর্ষ! পাতা উল্টানোর এবং অসাধারণ কিছু লেখার সময় এসেছে।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'নতুন বছর হলো একটা ফাঁকা বইয়ের মতো—কলম তোমার হাতে। একটা সুন্দর গল্প লেখো।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('নতুন বছর হলো একটা ফাঁকা বইয়ের মতো—কলম তোমার হাতে। একটা সুন্দর গল্প লেখো।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'নতুন বছর হলো একটা ফাঁকা বইয়ের মতো—কলম তোমার হাতে। একটা সুন্দর গল্প লেখো।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'অতীতকে ভুলে যাও, ক্ষমা করো এবং ২০২৬ সালে নতুন সুযোগকে স্বাগত জানাও।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('অতীতকে ভুলে যাও, ক্ষমা করো এবং ২০২৬ সালে নতুন সুযোগকে স্বাগত জানাও।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'অতীতকে ভুলে যাও, ক্ষমা করো এবং ২০২৬ সালে নতুন সুযোগকে স্বাগত জানাও।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'নতুন বছর সবকিছু ঠিক করার এবং একটি নতুন অধ্যায় শুরু করার আরেকটি সুযোগ নিয়ে আসে।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('নতুন বছর সবকিছু ঠিক করার এবং একটি নতুন অধ্যায় শুরু করার আরেকটি সুযোগ নিয়ে আসে।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'নতুন বছর সবকিছু ঠিক করার এবং একটি নতুন অধ্যায় শুরু করার আরেকটি সুযোগ নিয়ে আসে।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: '২০২৬ সাল হোক পরিবর্তনকে আলিঙ্গন করার এবং নির্ভীকভাবে তোমার স্বপ্নের পিছনে ছুটবার বছর।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('২০২৬ সাল হোক পরিবর্তনকে আলিঙ্গন করার এবং নির্ভীকভাবে তোমার স্বপ্নের পিছনে ছুটবার বছর।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: '২০২৬ সাল হোক পরিবর্তনকে আলিঙ্গন করার এবং নির্ভীকভাবে তোমার স্বপ্নের পিছনে ছুটবার বছর।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'নতুন বছরের প্রতিটি দিনই উজ্জ্বলভাবে আলোকিত হওয়ার এবং পূর্ণভাবে বেঁচে থাকার সুযোগ।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('নতুন বছরের প্রতিটি দিনই উজ্জ্বলভাবে আলোকিত হওয়ার এবং পূর্ণভাবে বেঁচে থাকার সুযোগ।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'নতুন বছরের প্রতিটি দিনই উজ্জ্বলভাবে আলোকিত হওয়ার এবং পূর্ণভাবে বেঁচে থাকার সুযোগ।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'এবার ২০২৬ সাল আপনার জন্য আগের চেয়েও উজ্জ্বল হয়ে উঠবে।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('এবার ২০২৬ সাল আপনার জন্য আগের চেয়েও উজ্জ্বল হয়ে উঠবে।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'এবার ২০২৬ সাল আপনার জন্য আগের চেয়েও উজ্জ্বল হয়ে উঠবে।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আপনার কঠোর পরিশ্রম এবং নিষ্ঠার জন্য ধন্যবাদ - আপনার জন্য একটি অসাধারণ ২০২৬ সালের শুভেচ্ছা।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আপনার কঠোর পরিশ্রম এবং নিষ্ঠার জন্য ধন্যবাদ - আপনার জন্য একটি অসাধারণ ২০২৬ সালের শুভেচ্ছা।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আপনার কঠোর পরিশ্রম এবং নিষ্ঠার জন্য ধন্যবাদ - আপনার জন্য একটি অসাধারণ ২০২৬ সালের শুভেচ্ছা।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: '২০২৬ সাল আমাদের আরও কাছে আনুক, আমাদের ভালোবাসা আরও গভীর করুক এবং আমাদের দিনগুলিকে আনন্দে ভরিয়ে দিক।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('২০২৬ সাল আমাদের আরও কাছে আনুক, আমাদের ভালোবাসা আরও গভীর করুক এবং আমাদের দিনগুলিকে আনন্দে ভরিয়ে দিক।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: '২০২৬ সাল আমাদের আরও কাছে আনুক, আমাদের ভালোবাসা আরও গভীর করুক এবং আমাদের দিনগুলিকে আনন্দে ভরিয়ে দিক।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: '২০২৬ সালে একসাথে ভালোবাসা, আবেগ এবং অবিস্মরণীয় মুহূর্তগুলি এখানে।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('২০২৬ সালে একসাথে ভালোবাসা, আবেগ এবং অবিস্মরণীয় মুহূর্তগুলি এখানে।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: '২০২৬ সালে একসাথে ভালোবাসা, আবেগ এবং অবিস্মরণীয় মুহূর্তগুলি এখানে।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমার সঙ্গী, আমার ভালোবাসা, আমার সবচেয়ে ভালো বন্ধুকে নববর্ষের শুভেচ্ছা।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমার সঙ্গী, আমার ভালোবাসা, আমার সবচেয়ে ভালো বন্ধুকে নববর্ষের শুভেচ্ছা।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমার সঙ্গী, আমার ভালোবাসা, আমার সবচেয়ে ভালো বন্ধুকে নববর্ষের শুভেচ্ছা।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'শুভ নববর্ষ! ২০২৬ সালে আমরা একসাথে যে স্মৃতিগুলো তৈরি করব তার জন্য আমি অধীর আগ্রহে অপেক্ষা করছি।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শুভ নববর্ষ! ২০২৬ সালে আমরা একসাথে যে স্মৃতিগুলো তৈরি করব তার জন্য আমি অধীর আগ্রহে অপেক্ষা করছি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'শুভ নববর্ষ! ২০২৬ সালে আমরা একসাথে যে স্মৃতিগুলো তৈরি করব তার জন্য আমি অধীর আগ্রহে অপেক্ষা করছি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমার প্রিয়তমের কাছে: এই বছর আমাদের ভালোবাসা আরও শক্তিশালী হোক এবং আমাদের বন্ধন আরও গভীর হোক।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমার প্রিয়তমের কাছে: এই বছর আমাদের ভালোবাসা আরও শক্তিশালী হোক এবং আমাদের বন্ধন আরও গভীর হোক।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমার প্রিয়তমের কাছে: এই বছর আমাদের ভালোবাসা আরও শক্তিশালী হোক এবং আমাদের বন্ধন আরও গভীর হোক।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমার একমাত্র সন্তানের জন্য রোমান্স, অ্যাডভেঞ্চার এবং সুখের এক বছরের শুভেচ্ছা।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমার একমাত্র সন্তানের জন্য রোমান্স, অ্যাডভেঞ্চার এবং সুখের এক বছরের শুভেচ্ছা।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমার একমাত্র সন্তানের জন্য রোমান্স, অ্যাডভেঞ্চার এবং সুখের এক বছরের শুভেচ্ছা।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'জীবনকে আরও সুন্দর করে তোলে, কেবল এতেই। আরও একটি অসাধারণ বছরের শুভেচ্ছা।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('জীবনকে আরও সুন্দর করে তোলে, কেবল এতেই। আরও একটি অসাধারণ বছরের শুভেচ্ছা।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'জীবনকে আরও সুন্দর করে তোলে, কেবল এতেই। আরও একটি অসাধারণ বছরের শুভেচ্ছা।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আসুন এই বছরটিকে হাসি, ভালোবাসা এবং স্বতঃস্ফূর্ত মুহূর্তগুলিতে পূর্ণ করি।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আসুন এই বছরটিকে হাসি, ভালোবাসা এবং স্বতঃস্ফূর্ত মুহূর্তগুলিতে পূর্ণ করি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আসুন এই বছরটিকে হাসি, ভালোবাসা এবং স্বতঃস্ফূর্ত মুহূর্তগুলিতে পূর্ণ করি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার ১২ মাসের সাফল্য, ৫২ সপ্তাহের হাসি, ৩৬৫ দিন আনন্দ এবং অসংখ্য আনন্দের মুহূর্ত কামনা করছি।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমার ১২ মাসের সাফল্য, ৫২ সপ্তাহের হাসি, ৩৬৫ দিন আনন্দ এবং অসংখ্য আনন্দের মুহূর্ত কামনা করছি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার ১২ মাসের সাফল্য, ৫২ সপ্তাহের হাসি, ৩৬৫ দিন আনন্দ এবং অসংখ্য আনন্দের মুহূর্ত কামনা করছি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'শুভ নববর্ষ! এই বছরটা উপভোগ করুন, প্রচুর পরিমাণে খাওয়া-দাওয়া, মদ্যপান এবং হাসি-ঠাট্টা করে কাটান।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শুভ নববর্ষ! এই বছরটা উপভোগ করুন, প্রচুর পরিমাণে খাওয়া-দাওয়া, মদ্যপান এবং হাসি-ঠাট্টা করে কাটান।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'শুভ নববর্ষ! এই বছরটা উপভোগ করুন, প্রচুর পরিমাণে খাওয়া-দাওয়া, মদ্যপান এবং হাসি-ঠাট্টা করে কাটান।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'এখানে গত বছরের ভুলগুলো ভুলে যাওয়া এবং মজার ভুলগুলো পুনরাবৃত্তি করা।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('এখানে গত বছরের ভুলগুলো ভুলে যাওয়া এবং মজার ভুলগুলো পুনরাবৃত্তি করা।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'এখানে গত বছরের ভুলগুলো ভুলে যাওয়া এবং মজার ভুলগুলো পুনরাবৃত্তি করা।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'শুভ নববর্ষ! আসুন স্টাইলে প্রশ্নবিদ্ধ সিদ্ধান্ত নিই।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শুভ নববর্ষ! আসুন স্টাইলে প্রশ্নবিদ্ধ সিদ্ধান্ত নিই।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'শুভ নববর্ষ! আসুন স্টাইলে প্রশ্নবিদ্ধ সিদ্ধান্ত নিই।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'নতুন বছর জুড়ে ঈশ্বরের ভালোবাসা এবং করুণা আপনার পথ আলোকিত করুক।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('নতুন বছর জুড়ে ঈশ্বরের ভালোবাসা এবং করুণা আপনার পথ আলোকিত করুক।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'নতুন বছর জুড়ে ঈশ্বরের ভালোবাসা এবং করুণা আপনার পথ আলোকিত করুক।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'ঈশ্বর আপনার এবং আপনার পরিবারকে সুস্থতা, সুখ এবং সমৃদ্ধিতে ভরপুর একটি বছর আশীর্বাদ করুন।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('ঈশ্বর আপনার এবং আপনার পরিবারকে সুস্থতা, সুখ এবং সমৃদ্ধিতে ভরপুর একটি বছর আশীর্বাদ করুন।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'ঈশ্বর আপনার এবং আপনার পরিবারকে সুস্থতা, সুখ এবং সমৃদ্ধিতে ভরপুর একটি বছর আশীর্বাদ করুন।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'শুভ নববর্ষ, দাদী এবং দাদু! তোমাদের ভালোবাসা এবং প্রজ্ঞা আমাকে আজকের এই অবস্থানে পৌঁছে দিয়েছে। ধন্যবাদ।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শুভ নববর্ষ, দাদী এবং দাদু! তোমাদের ভালোবাসা এবং প্রজ্ঞা আমাকে আজকের এই অবস্থানে পৌঁছে দিয়েছে। ধন্যবাদ।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'শুভ নববর্ষ, দাদী এবং দাদু! তোমাদের ভালোবাসা এবং প্রজ্ঞা আমাকে আজকের এই অবস্থানে পৌঁছে দিয়েছে। ধন্যবাদ।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'নতুন বছরকে স্বাগত জানাতে, আমার সর্বশ্রেষ্ঠ সমর্থনের জন্য আমি আন্তরিক কৃতজ্ঞতা প্রকাশ করতে চাই। ভালোবাসা এবং আনন্দে ভরে উঠুক আরও একটি বছর।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('নতুন বছরকে স্বাগত জানাতে, আমার সর্বশ্রেষ্ঠ সমর্থনের জন্য আমি আন্তরিক কৃতজ্ঞতা প্রকাশ করতে চাই। ভালোবাসা এবং আনন্দে ভরে উঠুক আরও একটি বছর।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'নতুন বছরকে স্বাগত জানাতে, আমার সর্বশ্রেষ্ঠ সমর্থনের জন্য আমি আন্তরিক কৃতজ্ঞতা প্রকাশ করতে চাই। ভালোবাসা এবং আনন্দে ভরে উঠুক আরও একটি বছর।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমাকে একটি অসাধারণ নববর্ষের শুভেচ্ছা! আমাদের জন্য, এখন এবং চিরকাল।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমাকে একটি অসাধারণ নববর্ষের শুভেচ্ছা! আমাদের জন্য, এখন এবং চিরকাল।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাকে একটি অসাধারণ নববর্ষের শুভেচ্ছা! আমাদের জন্য, এখন এবং চিরকাল।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'এই নতুন বছরে প্রবেশ করার সাথে সাথে, আমার নোঙ্গর এবং আমার সুখের সর্বশ্রেষ্ঠ উৎস হওয়ার জন্য আমি কৃতজ্ঞতা প্রকাশ করতে চাই। ভালোবাসা এবং আনন্দে ভরা আরেকটি বছরের জন্য এখানে রইলাম!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('এই নতুন বছরে প্রবেশ করার সাথে সাথে, আমার নোঙ্গর এবং আমার সুখের সর্বশ্রেষ্ঠ উৎস হওয়ার জন্য আমি কৃতজ্ঞতা প্রকাশ করতে চাই। ভালোবাসা এবং আনন্দে ভরা আরেকটি বছরের জন্য এখানে রইলাম!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'এই নতুন বছরে প্রবেশ করার সাথে সাথে, আমার নোঙ্গর এবং আমার সুখের সর্বশ্রেষ্ঠ উৎস হওয়ার জন্য আমি কৃতজ্ঞতা প্রকাশ করতে চাই। ভালোবাসা এবং আনন্দে ভরা আরেকটি বছরের জন্য এখানে রইলাম!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'ভালোবাসা আর হাসিতে ভরপুর নতুন বছরের শুভেচ্ছা। আমি সবসময় তোমার পাশে থাকার এবং প্রতিটি স্মৃতিকে কাজে লাগানোর প্রতিশ্রুতি দিচ্ছি। শুভ নববর্ষ!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('ভালোবাসা আর হাসিতে ভরপুর নতুন বছরের শুভেচ্ছা। আমি সবসময় তোমার পাশে থাকার এবং প্রতিটি স্মৃতিকে কাজে লাগানোর প্রতিশ্রুতি দিচ্ছি। শুভ নববর্ষ!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'ভালোবাসা আর হাসিতে ভরপুর নতুন বছরের শুভেচ্ছা। আমি সবসময় তোমার পাশে থাকার এবং প্রতিটি স্মৃতিকে কাজে লাগানোর প্রতিশ্রুতি দিচ্ছি। শুভ নববর্ষ!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'শুভ নববর্ষ! আসুন আমরা আরও সক্রিয় হওয়ার সংকল্প নিই... আমাদের প্রিয় অনুষ্ঠানগুলি সক্রিয়ভাবে বারবার দেখার মাধ্যমে শুরু করি!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শুভ নববর্ষ! আসুন আমরা আরও সক্রিয় হওয়ার সংকল্প নিই... আমাদের প্রিয় অনুষ্ঠানগুলি সক্রিয়ভাবে বারবার দেখার মাধ্যমে শুরু করি!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'শুভ নববর্ষ! আসুন আমরা আরও সক্রিয় হওয়ার সংকল্প নিই... আমাদের প্রিয় অনুষ্ঠানগুলি সক্রিয়ভাবে বারবার দেখার মাধ্যমে শুরু করি!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'শুভ নববর্ষ! তোমার অদ্ভুত আচরণ সহ্য করার ভান করে আমি আর আমারটা সহ্য করার ভান করার জন্য আরও একটি বছর। আমরা স্বর্গে তৈরি এক মিল!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('শুভ নববর্ষ! তোমার অদ্ভুত আচরণ সহ্য করার ভান করে আমি আর আমারটা সহ্য করার ভান করার জন্য আরও একটি বছর। আমরা স্বর্গে তৈরি এক মিল!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'শুভ নববর্ষ! তোমার অদ্ভুত আচরণ সহ্য করার ভান করে আমি আর আমারটা সহ্য করার ভান করার জন্য আরও একটি বছর। আমরা স্বর্গে তৈরি এক মিল!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমাকে একটা জাদুকরী নববর্ষের শুভেচ্ছা! আসুন আমরা একসাথে প্রতিটি মুহূর্তকে লালন করি এবং সুখের জীবন তৈরি করি।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমাকে একটা জাদুকরী নববর্ষের শুভেচ্ছা! আসুন আমরা একসাথে প্রতিটি মুহূর্তকে লালন করি এবং সুখের জীবন তৈরি করি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাকে একটা জাদুকরী নববর্ষের শুভেচ্ছা! আসুন আমরা একসাথে প্রতিটি মুহূর্তকে লালন করি এবং সুখের জীবন তৈরি করি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমার জীবনের ভালোবাসাকে নববর্ষের শুভেচ্ছা! এই বছর তোমার সকল সাফল্যের জন্য আমি গর্বিত এবং পরবর্তী কী হবে তা দেখার জন্য অধীর আগ্রহে অপেক্ষা করছি।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমার জীবনের ভালোবাসাকে নববর্ষের শুভেচ্ছা! এই বছর তোমার সকল সাফল্যের জন্য আমি গর্বিত এবং পরবর্তী কী হবে তা দেখার জন্য অধীর আগ্রহে অপেক্ষা করছি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমার জীবনের ভালোবাসাকে নববর্ষের শুভেচ্ছা! এই বছর তোমার সকল সাফল্যের জন্য আমি গর্বিত এবং পরবর্তী কী হবে তা দেখার জন্য অধীর আগ্রহে অপেক্ষা করছি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আসন্ন বছরটি আমাদের ভালোবাসার বিকাশের জন্য নতুন সুযোগ এবং অসংখ্য উপায় নিয়ে আসুক। এই সালে আমাদের জন্য যা কিছু আছে তা আলিঙ্গন করার জন্য এখানে রইল!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আসন্ন বছরটি আমাদের ভালোবাসার বিকাশের জন্য নতুন সুযোগ এবং অসংখ্য উপায় নিয়ে আসুক। এই সালে আমাদের জন্য যা কিছু আছে তা আলিঙ্গন করার জন্য এখানে রইল!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আসন্ন বছরটি আমাদের ভালোবাসার বিকাশের জন্য নতুন সুযোগ এবং অসংখ্য উপায় নিয়ে আসুক। এই সালে আমাদের জন্য যা কিছু আছে তা আলিঙ্গন করার জন্য এখানে রইল!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমাকে অসাধারণ নববর্ষের শুভেচ্ছা! তোমার সাথে আমার জীবন ভাগাভাগি করে নিতে পেরে আমি নিজেকে অত্যন্ত ভাগ্যবান মনে করছি। একসাথে, আমরা আমাদের পথে আসা যেকোনো চ্যালেঞ্জকে অতিক্রম করতে পারি। এবার সালকে আলিঙ্গন করা যাক। আমরা সামনের সমস্ত অভিযানের জন্য প্রস্তুত!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমাকে অসাধারণ নববর্ষের শুভেচ্ছা! তোমার সাথে আমার জীবন ভাগাভাগি করে নিতে পেরে আমি নিজেকে অত্যন্ত ভাগ্যবান মনে করছি। একসাথে, আমরা আমাদের পথে আসা যেকোনো চ্যালেঞ্জকে অতিক্রম করতে পারি। এবার সালকে আলিঙ্গন করা যাক। আমরা সামনের সমস্ত অভিযানের জন্য প্রস্তুত!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমাকে অসাধারণ নববর্ষের শুভেচ্ছা! তোমার সাথে আমার জীবন ভাগাভাগি করে নিতে পেরে আমি নিজেকে অত্যন্ত ভাগ্যবান মনে করছি। একসাথে, আমরা আমাদের পথে আসা যেকোনো চ্যালেঞ্জকে অতিক্রম করতে পারি। এবার সালকে আলিঙ্গন করা যাক। আমরা সামনের সমস্ত অভিযানের জন্য প্রস্তুত!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমাদের বন্ধুত্বের জন্য আমি খুবই কৃতজ্ঞ, এবং আমি আশা করি আগামী বছরটি এটিকে সুন্দরভাবে বৃদ্ধি, শক্তিশালীকরণ এবং প্রস্ফুটিত করার জন্য আরও সুযোগ নিয়ে আসবে।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমাদের বন্ধুত্বের জন্য আমি খুবই কৃতজ্ঞ, এবং আমি আশা করি আগামী বছরটি এটিকে সুন্দরভাবে বৃদ্ধি, শক্তিশালীকরণ এবং প্রস্ফুটিত করার জন্য আরও সুযোগ নিয়ে আসবে।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমাদের বন্ধুত্বের জন্য আমি খুবই কৃতজ্ঞ, এবং আমি আশা করি আগামী বছরটি এটিকে সুন্দরভাবে বৃদ্ধি, শক্তিশালীকরণ এবং প্রস্ফুটিত করার জন্য আরও সুযোগ নিয়ে আসবে।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'এই বছর আমরা একসাথে সবচেয়ে ভালো সময় কাটিয়েছি। আশা করি, আগামী বছর আমাদের জন্য আরও মজা এবং অ্যাডভেঞ্চার নিয়ে আসবে।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('এই বছর আমরা একসাথে সবচেয়ে ভালো সময় কাটিয়েছি। আশা করি, আগামী বছর আমাদের জন্য আরও মজা এবং অ্যাডভেঞ্চার নিয়ে আসবে।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'এই বছর আমরা একসাথে সবচেয়ে ভালো সময় কাটিয়েছি। আশা করি, আগামী বছর আমাদের জন্য আরও মজা এবং অ্যাডভেঞ্চার নিয়ে আসবে।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'আমার প্রিয় মানুষটিকে, নতুন বছর আমাদের জন্য কী অপেক্ষা করছে তা দেখার জন্য আমি অধীর আগ্রহে অপেক্ষা করছি।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('আমার প্রিয় মানুষটিকে, নতুন বছর আমাদের জন্য কী অপেক্ষা করছে তা দেখার জন্য আমি অধীর আগ্রহে অপেক্ষা করছি।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'আমার প্রিয় মানুষটিকে, নতুন বছর আমাদের জন্য কী অপেক্ষা করছে তা দেখার জন্য আমি অধীর আগ্রহে অপেক্ষা করছি।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'তোমার স্বপ্ন পূরণের আরও এক বছর এগিয়ে আসো। এই বছরটা তোমার আকাঙ্ক্ষার সবকিছু হোক এবং আরও অনেক কিছু হোক!',
            favoriteButton: (){},
            shareButton: (){
              Share.share('তোমার স্বপ্ন পূরণের আরও এক বছর এগিয়ে আসো। এই বছরটা তোমার আকাঙ্ক্ষার সবকিছু হোক এবং আরও অনেক কিছু হোক!');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'তোমার স্বপ্ন পূরণের আরও এক বছর এগিয়ে আসো। এই বছরটা তোমার আকাঙ্ক্ষার সবকিছু হোক এবং আরও অনেক কিছু হোক!',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'কঠিনতম সময়েও কাজকে মজাদার এবং উপভোগ্য করে তোলার জন্য ধন্যবাদ। আসন্ন বছরটি আমাদের আরও ভালোবাসা এবং হাসি বয়ে আনুক।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('কঠিনতম সময়েও কাজকে মজাদার এবং উপভোগ্য করে তোলার জন্য ধন্যবাদ। আসন্ন বছরটি আমাদের আরও ভালোবাসা এবং হাসি বয়ে আনুক।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'কঠিনতম সময়েও কাজকে মজাদার এবং উপভোগ্য করে তোলার জন্য ধন্যবাদ। আসন্ন বছরটি আমাদের আরও ভালোবাসা এবং হাসি বয়ে আনুক।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
          ReadSms(
            message: 'সাফল্য, ভালোবাসা এবং অর্থপূর্ণ অভিজ্ঞতায় ভরা একটি বছরের জন্য শুভেচ্ছা।',
            favoriteButton: (){},
            shareButton: (){
              Share.share('সাফল্য, ভালোবাসা এবং অর্থপূর্ণ অভিজ্ঞতায় ভরা একটি বছরের জন্য শুভেচ্ছা।');
            },
            copyButton: () {
              Clipboard.setData(
                  ClipboardData(
                    text: 'সাফল্য, ভালোবাসা এবং অর্থপূর্ণ অভিজ্ঞতায় ভরা একটি বছরের জন্য শুভেচ্ছা।',));
              ScaffoldMessenger.of(context,).showSnackBar(SnackBar(content: Text("Copied!")));
            },
          ),
        ],
      ),
    );
  }
}*/
